[
    {
      "title": "Unlocking Android",
      "isbn": "1933988673",
      "pageCount": 416,
      "publishedDate": {
        "$date": "2009-04-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson.jpg",
      "shortDescription": "Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout.",
      "longDescription": "Android is an open source mobile phone platform based on the Linux operating system and developed by the Open Handset Alliance, a consortium of over 30 hardware, software and telecom companies that focus on open standards for mobile devices. Led by search giant, Google, Android is designed to deliver a better and more open and cost effective mobile experience.    Unlocking Android: A Developer's Guide provides concise, hands-on instruction for the Android operating system and development tools. This book teaches important architectural concepts in a straightforward writing style and builds on this with practical and useful examples throughout. Based on his mobile development experience and his deep knowledge of the arcane Android technical documentation, the author conveys the know-how you need to develop practical applications that build upon or replace any of Androids features, however small.    Unlocking Android: A Developer's Guide prepares the reader to embrace the platform in easy-to-understand language and builds on this foundation with re-usable Java code examples. It is ideal for corporate and hobbyists alike who have an interest, or a mandate, to deliver software functionality for cell phones.    WHAT'S INSIDE:        * Android's place in the market      * Using the Eclipse environment for Android development      * The Intents - how and why they are used      * Application classes:            o Activity            o Service            o IntentReceiver       * User interface design      * Using the ContentProvider to manage data      * Persisting data with the SQLite database      * Networking examples      * Telephony applications      * Notification methods      * OpenGL, animation & multimedia      * Sample Applications  ",
      "status": "PUBLISH",
      "authors": [
        "W. Frank Ableson",
        "Charlie Collins",
        "Robi Sen"
      ],
      "categories": [
        "Open Source",
        "Mobile"
      ],
      "price": 187.19966837604463
    },
    {
      "title": "Explorer's Guide to the Semantic Web",
      "isbn": "1932394206",
      "pageCount": 304,
      "publishedDate": {
        "$date": "2004-06-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/passin.jpg",
      "shortDescription": "\"A thorough look at one vision of the Web's future ...particularly well written...Highly recommended.\" -- Choice Magazine",
      "longDescription": "A complex set of extensions to the World Wide Web, the Semantic Web will make data and services more accessible to computers and useful to people. Some of these extensions are being deployed, and many are coming in the next years. This is the only book to explore the territory of the Semantic Web in a broad and conceptual manner.    This Guide acquaints you with the basic ideas and technologies of the Semantic Web, their roles and inter-relationships. The key areas covered include knowledge modeling (RDF, Topic Maps), ontology (OWL), agents (intelligent and otherwise), distributed trust and belief, \"semantically-focused\" search, and much more.    The book's basic, conceptual approach is accessible to readers with a wide range of backgrounds and interests. Important points are illustrated with diagrams and occasional markup fragments. As it explores the landscape it encounters an ever-surprising variety of novel ideas and unexpected links. The book is easy and fun to read - you may find it hard to put down.    The Semantic Web is coming. This is a guide to the basic concepts and technologies that will come with it.",
      "status": "PUBLISH",
      "authors": [
        "Thomas B. Passin"
      ],
      "categories": [
        "Internet",
        "Theory",
        "XML"
      ],
      "price": 986.6021354962049
    },
    {
      "title": "Practical LotusScript",
      "isbn": "1884777767",
      "pageCount": 512,
      "publishedDate": {
        "$date": "1999-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/patton.jpg",
      "longDescription": "Practical LotusScript covers the LotusScript programming language like no other book on the market. It starts with the core languge and proceeds to cover the specifics of Lotus Notes in complete detail. Advanced topics include report generation, working with the web, Office 97 integration, and 5.0 enhancements.  Practical LotusScript is designed for:    Lotus Notes developers, both experienced and inexperienced  Visual Basic programmers looking to get up to speed in the Notes environment  any developer wanting more information on the Notes/Domino development environment  ",
      "status": "PUBLISH",
      "authors": [
        "Anthony Patton"
      ],
      "categories": [
        "Business"
      ],
      "price": 728.7055747324245
    },
    {
      "title": "Domino Development with Java",
      "isbn": "1930110049",
      "pageCount": 467,
      "publishedDate": {
        "$date": "2000-08-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/patton2.jpg",
      "longDescription": "Domino Development with Java takes the mysteries out of using the Java programming language within the Domino development environment. It provides a solid foundation for working utilization of the Java programming language in the Domino Application Server environment. The reader will learn how to build servlets, applets, JDBC, and standalone applications.    The book culminates with the implementation of an on-line shopping store using Domino and Java. Both WebSphere and VisualAge for Java integration are also covered.",
      "status": "PUBLISH",
      "authors": [
        "Anthony Patton"
      ],
      "categories": [
        "Java"
      ],
      "price": 858.8559170027559
    },
    {
      "title": "Windows PowerShell in Action",
      "isbn": "1932394907",
      "pageCount": 576,
      "publishedDate": {
        "$date": "2007-02-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/payette.jpg",
      "shortDescription": "   If all it had going for it was the authoratative pedigree of the writer, it might be worth it, but it's also well-written, well-organized, and thorough, which I think makes it invaluable as both a learning tool and a reference.       Slashdot.org",
      "longDescription": "Windows has an easy-to-use interface, but if you want to automate it, life can get hard. That is, unless you use PowerShell, an elegant new dynamic language from Microsoft designed as an all-purpose Windows scripting tool. PowerShell lets you script administrative tasks and control Windows from the command line. Because it was specifically developed for Windows, programmers and power-users can now do things in a shell that previously required VB, VBScript, or C#.    Windows PowerShell in Action was written by Bruce Payette, one of the founding members of the Windows PowerShell team, co-designer of the PowerShell language and the principal author of the PowerShell language implementation. From him you will gain a deep understanding of the language and how best to use it, and you'll love his insights into why PowerShell works the way it does.    This book is a tutorial for sysadmins and developers introducing the PowerShell language and its environment. It shows you how to build scripts and utilities to automate system tasks or create powerful system management tools to handle the day-to-day tasks that drive a Windows administrator's life. It's rich in interesting examples that will spark your imagination. The book covers batch scripting and string processing, COM, WMI, and even .NET and WinForms programming.",
      "status": "PUBLISH",
      "authors": [
        "Bruce Payette"
      ],
      "categories": [
        "Microsoft"
      ],
      "price": 810.2299786305747
    },
    {
      "title": "Windows PowerShell in Action, Second Edition",
      "isbn": "1935182137",
      "pageCount": 700,
      "publishedDate": {
        "$date": "2011-05-15T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/payette2.jpg",
      "shortDescription": "Windows PowerShell in Action, Second Edition is a completely revised edition of the best selling book on PowerShell, written by Bruce Payette, one of the founding members of the Windows PowerShell team, co-designer of the PowerShell language, and the principal author of the PowerShell language implementation.    This new edition preserves the crystal-clear introduction to PowerShell, showing sysadmins and developers how to build scripts and utilities to automate system tasks or create powerful system management tools to handle day-to-day tasks. It's rich with interesting examples that will spark your imagination. The book covers batch scripting and string processing, COM, WMI, remote management and jobs and even .NET programming including WinForms and WPF/XAML.",
      "longDescription": "Windows PowerShell transformed the way administrators and developers interact with Windows. PowerShell, an elegant dynamic language from Microsoft, lets you script administrative tasks and control Windows from the command line. Because it's a full-featured, first-class Windows programming language, programmers and power-users can now do things in a shell that previously required VB, VBScript, or C#.    Windows PowerShell in Action, Second Edition is a completely revised edition of the best selling book on PowerShell, written by Bruce Payette, one of the founding members of the Windows PowerShell team, co-designer of the PowerShell language, and the principal author of the PowerShell language implementation.    This new edition preserves the crystal-clear introduction to PowerShell, showing sysadmins and developers how to build scripts and utilities to automate system tasks or create powerful system management tools to handle day-to-day tasks. It's rich with interesting examples that will spark your imagination. The book covers batch scripting and string processing, COM, WMI, remote management and jobs and even .NET programming including WinForms and WPF/XAML.    Windows PowerShell in Action, Second Edition adds full coverage of V2 features like remote, changes to the threading model, and the new -split and -join operators. The book now includes full chapters on Remoting, Modules, Events and Transactions, and the PowerShell Integrated Scripting Environment. As well, it provides deeper coverage of PowerShell \"commandlets\" (cmdlets) and more of the popular usage scenarios throughout the book.",
      "status": "PUBLISH",
      "authors": [
        "Bruce Payette"
      ],
      "categories": [
        "Microsoft"
      ],
      "price": 685.5842746821954
    },
    {
      "title": "Silverlight 4 in Action, Revised Edition",
      "isbn": "1935182374",
      "pageCount": 425,
      "publishedDate": {
        "$date": "2010-10-04T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pbrown.jpg",
      "shortDescription": "Silverlight in Action, Revised Edition is a comprehensive guide to Silverlight, taking you from Hello World through the techniques you'll need to build sophisticated rich web apps. This new edition covers all the new features added in the latest versions of Silverlight, Visual Studio, and Expression Blend, along with the best practices emerging in the Silverlight community. With more than 50% new content, you'll take a mind-expanding trip through the technology, features, and techniques required to build applications ranging from media, to custom experiences, to business applications to games.",
      "longDescription": "Anyone who has gotten a taste of what it can do knows that Silverlight represents an entirely new level of rich web interface technology for Microsoft developers. With Silverlight, developers can use JavaScript, C#, and other languages to build user-friendly, interactive, and visually-dazzling web applications that work in most major browsers.    Silverlight in Action, Revised Edition is a comprehensive guide to Silverlight, taking you from Hello World through the techniques you'll need to build sophisticated rich web apps. This new edition covers all the new features added in the latest versions of Silverlight, Visual Studio, and Expression Blend, along with the best practices emerging in the Silverlight community. With more than 50% new content, you'll take a mind-expanding trip through the technology, features, and techniques required to build applications ranging from media, to custom experiences, to business applications to games.    Beyond the fundamentals, you'll find numerous practical examples of important patterns like the ViewModel (or MVVM) pattern, and effective practices for developing real-world applications. You'll delve into the underlying object model and what makes Silverlight tick. Business application developers will appreciate the coverage of the exciting new.NET RIA Services. Combined with advanced binding and validation techniques, they help you visualize how to make your application development super productive and your architecture flexible enough to implement solutions in any problem domain.    Silverlight in Action, Revised Edition devotes extensive coverage to flexible layout components, the extensible control model, the communication framework, and the data-binding features-all cornerstones of software development. You'll master Silverlight's rich media and vivid graphical and animation features. The closing chapters include a variety of Silverlight deployment and customization scenarios.    Finally, Silverlight in Action, Revised Edition doesn't leave you in the dark when it comes to testing and debugging your applications. Techniques, tools, and patterns to support testable Silverlight applications are woven throughout the chapters, with additional dedicated content on the specifics of testing and debugging in Silverlight.",
      "status": "PUBLISH",
      "authors": [
        "Pete Brown"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 424.7217235750356
    },
    {
      "title": "Silverlight 5 in Action",
      "isbn": "1617290319",
      "pageCount": 925,
      "publishedDate": {
        "$date": "2012-06-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pbrown2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Pete Brown"
      ],
      "categories": [
        "Microsoft",
        ".NET"
      ],
      "price": 31.9554559368489
    },
    {
      "title": "Hibernate Quickly",
      "isbn": "1932394419",
      "pageCount": 456,
      "publishedDate": {
        "$date": "2005-08-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/peak.jpg",
      "shortDescription": "\"If you want to learn Hibernate quickly, this book shows you step by step.\" - Sang Shin, Java Technology Architect, Sun Microsystems",
      "longDescription": "Positioned as a layer between the application and the database, Hibernate is a powerful object/relational persistence and query service for Java. It takes care of automating a tedious task: the manual bridging of the gap between object oriented code and the relational database. Hibernate Quickly gives you all you need to start working with Hibernate now.    The book focuses on the 20% you need 80% of the time. The pages saved are used to introduce you to the Hibernate \"ecosystem\": how Hibernate can work with other common development tools and frameworks like XDoclet, Struts, Webwork, Spring, and Tapestry.    The book builds its code examples incrementally, introducing new concepts as it goes. It covers Hibernate's many, useful configuration and design options, breaking a complex subject into digestible pieces. With a gradual \"crawl-walk-run\" approach, the book teaches you what Hibernate is, what it can do, and how you can work with it effectively.",
      "status": "PUBLISH",
      "authors": [
        "Patrick Peak",
        "Nick Heudecker"
      ],
      "categories": [
        "Java"
      ],
      "price": 430.12989057825604
    },
    {
      "title": "Generative Art",
      "isbn": "1935182625",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2011-06-30T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pearson.jpg",
      "status": "PUBLISH",
      "authors": [
        "Matt Pearson"
      ],
      "categories": [
        "Algorithmic Art"
      ],
      "price": 662.4121440711483
    },
    {
      "title": "The Cloud at Your Service",
      "isbn": "1935182528",
      "pageCount": 200,
      "publishedDate": {
        "$date": "2010-11-22T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rosenberg.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jothy Rosenberg",
        "Arthur Mateos"
      ],
      "categories": [
        "Internet"
      ],
      "price": 955.1998683307834
    },
    {
      "title": "Implementing Elliptic Curve Cryptography",
      "isbn": "1884777694",
      "pageCount": 330,
      "publishedDate": {
        "$date": "1998-11-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rosing.jpg",
      "shortDescription": "\"The book provides all the theory and working programs needed to create real applications based on the latest IEEE P1363 standard.\"  --Reviewed in Cryptologia",
      "longDescription": "Implementing Elliptic Curve Cryptography proceeds step-by-step to explain basic number theory, polynomial mathematics, normal basis mathematics and elliptic curve mathematics. With these in place, applications to cryptography are introduced. The book is filled with C code to illustrate how mathematics is put into a computer, and the last several chapters show how to implement several cryptographic protocols. The most important is a description of P1363, an IEEE draft standard for public key cryptography.    The main purpose of Implementing Elliptic Curve Cryptography is to help \"crypto engineers\" implement functioning, state-of-the-art cryptographic algorithms in the minimum time. With detailed descriptions of the mathematics, the reader can expand on the code given in the book and develop optimal hardware or software for their own applications.    Implementing Elliptic Curve Cryptography assumes the reader has at least a high school background in algebra, but it explains, in stepwise fashion, what has been considered to be a topic only for graduate-level students. ",
      "status": "PUBLISH",
      "authors": [
        "Michael Rosing"
      ],
      "categories": [
        "Theory"
      ],
      "price": 56.69597651210889
    },
    {
      "title": "SOA Patterns",
      "isbn": "1933988266",
      "pageCount": 250,
      "publishedDate": {
        "$date": "2012-09-12T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rotem.jpg",
      "shortDescription": "In SOA Patterns, author Arnon Rotem-Gal-Oz provides detailed, technology-neutral solutions to these challenges, and many others. This book provides architectural guidance through patterns and anti-patterns. It shows you how to build real SOA services that feature flexibility, availability, and scalability.",
      "longDescription": "SOA   Service Oriented Architecture   has become the leading solution for complex, connected business systems. While it's easy to grasp the theory of SOA, implementing well-designed, practical SOA systems can be a difficult challenge. Developers and enterprise architects still face the following issues:        * How to get high-availability with SOA      * How to know a service has failed      * How to create reports when data is scattered within multiple services      * How to increase the loose coupling of your SOA      * How to solve authentication and authorization for service consumers--internal and external      * How to integrate SOA and the UI      * How to avoid common SOA pitfalls      * How to choose technologies that increase the performance of your services    In SOA Patterns, author Arnon Rotem-Gal-Oz provides detailed, technology-neutral solutions to these challenges, and many others. This book provides architectural guidance through patterns and anti-patterns. It shows you how to build real SOA services that feature flexibility, availability, and scalability. Through an extensive set of patterns, this book identifies the major SOA pressure points and provides reusable techniques to address them. Each pattern pairs the classic Problem/Solution format with a unique technology map, showing where specific solutions fit into the general pattern.    SOA Patterns shows you how to address common SOA concerns, including the areas of performance, availability, scalability, security, management, service interaction, user interface interaction, and service aggregation. The SOA anti-patterns part shows you how to avoid common mistakes and how to refactor broken systems. The book also maps quality attributes to patterns so that you can easily find the patterns relevant to your problems.    WHAT'S INSIDE:        * Details more than 30 patterns for common SOA scenarios in the areas of security, performace, availability, UI integration, service aggregation and service interaction      * Describes more than 20 SOA pitfalls to avoid      * Spotlights the architecural perspective on SOA      * Explains technology mapping from conceptual solution to current technologies      * Provides extensive and practical advice on matching patterns to technologies  ",
      "status": "PUBLISH",
      "authors": [
        "Arnon Rotem-Gal-Oz"
      ],
      "categories": [
        "SOA"
      ],
      "price": 963.0953131878443
    },
    {
      "title": "Hello World!",
      "isbn": "1933988495",
      "pageCount": 432,
      "publishedDate": {
        "$date": "2009-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sande.jpg",
      "shortDescription": "Hello World! provides a gentle but thorough introduction to the world of computer programming.",
      "longDescription": "Your computer won't respond when you yell at it. Why not learn to talk to your computer in its own language  Whether you want to write games, start a business, or you're just curious, learning to program is a great place to start. Plus, programming is fun!    Hello World! provides a gentle but thorough introduction to the world of computer programming. It's written in language a 12-year-old can follow, but anyone who wants to learn how to program a computer can use it. Even adults. Written by Warren Sande and his son, Carter, and reviewed by professional educators, this book is kid-tested and parent-approved.    You don't need to know anything about programming to use the book. But you should know the basics of using a computer--e-mail, surfing the web, listening to music, and so forth. If you can start a program and save a file, you should have no trouble using this book.",
      "status": "PUBLISH",
      "authors": [
        "Warren D. Sande",
        "Carter Sande"
      ],
      "categories": [
        "Programming",
        "Python"
      ],
      "price": 80.82782325726146
    },
    {
      "title": "SCBCD Exam Study Kit",
      "isbn": "1932394400",
      "pageCount": 488,
      "publishedDate": {
        "$date": "2005-06-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sanghera.jpg",
      "longDescription": "There is probably no Java certification more valuable to you than Sun Certified Business Component Developer CX-310-090. To pass you need a readable, no-nonsense book focused like a laser beam on the exam goals. SCBCD Exam Study Kit is that book.    The study kit makes sure you first understand all the concepts you need to know, large and small, and then covers every single exam topic. It provides more than 130 review questions with answers distributed over all chapters and an Exam's Eye View section at the end of each chapter on the important points to remember.    Although SCBCD Exam Study Kit has only one purpose - to help you get certified - you will find yourself returning to it as a reference after passing the exam. A demo on how to install the necessary software, write a simple bean, deploy the bean, and execute it, as well as a free SCBCD exam simulator can be downloaded from the publisher's website.",
      "status": "PUBLISH",
      "authors": [
        "Paul Sanghera"
      ],
      "categories": [
        "Java"
      ],
      "price": 786.1701452607728
    },
    {
      "title": "Portlets in Action",
      "isbn": "1935182544",
      "pageCount": 475,
      "publishedDate": {
        "$date": "2011-09-16T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sarin.jpg",
      "shortDescription": "Portlets in Action is a comprehensive guide for Java developers with minimal or no experience working with portlets. Fully exploring the Portlet 2.0 API and using widely adopted frameworks like Spring 3.0 Portlet MVC, Hibernate, and DWR, it teaches you portal and portlet development by walking you through a Book Catalog portlet and Book Portal examples.",
      "longDescription": "A \"portal\" is a browser-based container populated by small applications called \"portlets\". Good portlets need to work independently, but also communicate with the portal, other portlets, and outside servers and information sources. Whether they're part of internal or web-facing portals, high-quality portlets are the foundation of a fast, flexible, and successful development strategy.    Portlets in Action is a comprehensive guide for Java developers with minimal or no experience working with portlets. Fully exploring the Portlet 2.0 API and using widely adopted frameworks like Spring 3.0 Portlet MVC, Hibernate, and DWR, it teaches you portal and portlet development by walking you through a Book Catalog portlet and Book Portal examples. The example Book Catalog Portlet, developed incrementally in each chapter of the book, incorporates most key portlet features, and the accompanying source code can be easily adapted and reused by readers. The example Book Portal application introduces you to the challenges faced in developing web portals.  WHAT'S INSIDE        * Complete coverage of Portlet 2.0 API      * New features added in Portlet 2.0      * Code examples use      * Develop rich portlets using AJAX with DWR, DOJO, and jQuery      * Complete coverage of Spring 3.0 Portlet MVC and the Liferay portal server  ",
      "status": "PUBLISH",
      "authors": [
        "Ashish Sarin"
      ],
      "categories": [
        "Java"
      ],
      "price": 230.09477885398533
    },
    {
      "title": "SWT/JFace in Action",
      "isbn": "1932394273",
      "pageCount": 496,
      "publishedDate": {
        "$date": "2004-11-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/scarpino.jpg",
      "shortDescription": "Guides you through the process of developing Eclipse-based GUIs and shows how to build applications with features your users will love. Packed with examples and no fluff.",
      "longDescription": "SWT and JFace are Eclipse's graphical libraries. They enable you to build nimble and powerful Java GUIs--but this is only the beginning. With Draw2D and the Graphical Editing Framework, you can go beyond static applications and create full-featured editors. And with the Rich Client Platform, you can build customized workbenches whose capabilities far exceed those of traditional interfaces.    SWT/JFace in Action covers the territory, from simple widgets to complex graphics. It guides you through the process of developing Eclipse-based GUIs and shows how to build applications with features your users will love. The authors share their intimate knowledge of the subject with you in a friendly, readable style.    This book encourages you to learn through action. Each topic provides extensive code to show you how SWT/JFace works in practical applications. Not only do these examples help you understand the subject, they are a working set of programs you can reuse in your own interfaces.",
      "status": "PUBLISH",
      "authors": [
        "Matthew Scarpino",
        "Stephen Holder",
        "Stanford Ng",
        "",
        "Laurent Mihalkovic"
      ],
      "categories": [
        "Java"
      ],
      "price": 578.4225946826391
    },
    {
      "title": "OpenCL in Action",
      "isbn": "1617290173",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2011-11-14T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/scarpino2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Matthew Scarpino"
      ],
      "categories": [
        "Programming"
      ],
      "price": 310.35588752969255
    },
    {
      "title": "Multiprotocol over ATM",
      "isbn": "138892709",
      "pageCount": 341,
      "publishedDate": {
        "$date": "1998-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/schmidt.jpg",
      "shortDescription": "With the detailed coverage of the entire set of protocols in Multiprotocol over ATM, you can be equal to the task.",
      "longDescription": "Networks constructed with current ATM protocol design standards exceed by far former network capabilities. Unfortunately, this new ATM power and flexibility come at the cost of greater complexity. With the detailed coverage of the entire set of protocols in Multiprotocol over ATM, you can be equal to the task. If you're a network manager or designer, responsible for planning, building, or managing an enterprise or campus network, this book is for you.",
      "status": "PUBLISH",
      "authors": [
        "Andrew Schmidt",
        "Daniel Minoli"
      ],
      "categories": [
        "Internet",
        "Networking"
      ],
      "price": 270.5453178548649
    },
    {
      "title": "Dependency Injection in .NET",
      "isbn": "1935182501",
      "pageCount": 375,
      "publishedDate": {
        "$date": "2011-10-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/seemann.jpg",
      "shortDescription": "Dependency Injection in .NET is a comprehensive guide than introduces DI and provides an in-depth look at applying DI practices to .NET apps. In it, you will also learn to integrate DI together with such technologies as Windows Communication Foundation, ASP.NET MVC, Windows Presentation Foundation and other core .NET components.",
      "longDescription": "Dependency Injection (DI) is a software design technique emphasizing Separation of Concerns, Modularity, Extensibility and Testability. Applied well, it enables programmers to successfully deal with complexity in software and add new features to existing apps with greater ease. DI is the key to writing modular software and producing flexible and maintainable code bases.    While well-known among Java developers and other practitioners of object-oriented design, DI is only now gaining momentum in the .NET community. The Unity container released by Microsoft patterns & practices and the new Microsoft Extensibility Framework (MEF) make DI more relevant than ever for .NET developers.    Dependency Injection in .NET is a comprehensive guide than introduces DI and provides an in-depth look at applying DI practices to .NET apps. In it, you will also learn to integrate DI together with such technologies as Windows Communication Foundation, ASP.NET MVC, Windows Presentation Foundation and other core .NET components.    Building on your existing knowledge of C# and the .NET platform, this book will be most beneficial for readers who have already built at least a few software solutions of intermediate complexity. Most examples are in plain C# without use of any particular DI framework. Later, the book introduces several well-known DI frameworks, such as StructureMap, Windsor and Spring.NET. For each framework, it presents examples of its particular usage, as well as examines how the framework relates to the common patterns presented earlier in the book.    WHAT'S INSIDE        * A thorough introduction to DI principles applied to .NET development      * Numerous C#-based examples      * A comprehensive catalog of Patterns and Anti-Patterns      * Understand the importance of loose coupling      * Learn DI Containers including StructureMap, Windsor, Spring.NET and the Microsoft Extensibility Framework      * Identify and avoid common traps",
      "status": "PUBLISH",
      "authors": [
        "Mark Seemann"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 461.16703573716956
    },
    {
      "title": "Java 3D Programming",
      "isbn": "1930110359",
      "pageCount": 400,
      "publishedDate": {
        "$date": "2002-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/selman.jpg",
      "longDescription": "Java 3D Programming steps programmers through the important design and implementation phases of developing a successful Java 3D application. The book provides invaluable guidance on whether to use Java 3D, user interface design, geometry creation, scene manipulation and final optimizations. The book does not attempt to exhaustively cover the API or replicate the official documentation but rather serves as a roadmap to alert programmers of design issues and potential pitfalls.    The author distills 12 months of using the Java 3D API for commercial projects, as well as innumerable discussions on the Java 3D email list into a book that all Java 3D developers will appreciate. Experienced Java 3D developers will applaud an authoritative resource containing the state-of-the-art in techniques and workarounds, while novice Java 3D programmers will gain a fast-track into Java 3D development, avoiding the confusion, frustration and time wasted learning Java 3D techniques and terminology.    Java 3D Programming comes complete with a comprehensive set of programming examples to illustrate the techniques, features, workarounds and bug fixes contained in the main text.    Readers of this book would include students and postgraduate researchers developing visualization applications for academia. Moderately experienced in Java, some experience of 3D graphics, little or no experience of Java 3D is needed. R+D s/w engineers at commercial institutions. Experienced Java developers, experienced with OpenGL or VRML, little or no experience with Java 3D.",
      "status": "PUBLISH",
      "authors": [
        "Daniel Selman"
      ],
      "categories": [
        "Java",
        "Internet",
        "Computer Graph"
      ],
      "price": 49.81580355863002
    },
    {
      "title": "Liferay in Action",
      "isbn": "193518282X",
      "pageCount": 375,
      "publishedDate": {
        "$date": "2011-09-20T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sezov.jpg",
      "status": "PUBLISH",
      "authors": [
        "Richard Sezov",
        "Jr"
      ],
      "categories": [
        "Internet"
      ],
      "price": 850.1433895097721
    },
    {
      "title": "JSP Tag Libraries",
      "isbn": "193011009X",
      "pageCount": 656,
      "publishedDate": {
        "$date": "2001-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shachor.jpg",
      "longDescription": "JSP Tag Libraries is a bible for serious JSP developers. The reader will become acquainted with the world of custom JSP tags--new JSP technology that is beginning to have an enormous impact on the way people are developing JSP.    JSP tags are Java components that can be used from within a JSP file. By representing these components as tags, code authors can open up their JSP development to the everyday content developer as well as improve their code reuse and separation between presentation and business logic.    The book is fully loaded with many real-world tags including tags to perform iterations, access databases, EJBs, email systems and JavaBeans. To make the tag usage even more real, the book also offers two full-scale case studies in which the reader will see how tags can be used in the context of:    e-Commerce applications  WAP applications that work with current cellular phones  This book covers all aspects of JSP Tag development for Scriptlet-free generation of online content. It focuses on reusable component-centric design via JavaBeans and custom tags to separate presentation from implementation.",
      "status": "PUBLISH",
      "authors": [
        "Gal Shachor",
        "Adam Chace",
        "Magnus Rydin"
      ],
      "categories": [
        "Java",
        "Internet"
      ],
      "price": 481.37959016025087
    },
    {
      "title": "Instant Messaging in Java",
      "isbn": "1930110464",
      "pageCount": 402,
      "publishedDate": {
        "$date": "2002-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shigeoka.jpg",
      "shortDescription": "This intermediate Java programming book provides Java programmers with the information and tools needed to create your own IM client and server software.",
      "longDescription": "Instant Messaging has exploded into the online world and is a wildly popular service of the largest Internet Service Providers (ISP) like AOL with AOL Instant Messenger, MSN with Microsoft Messenger, and Yahoo with Yahoo Messenger. Millions of Internet users everyday exchange IM s and its use beyond messaging is just around the corner. For example, the new Microsoft .NET platform will be using instant messaging technology for data exchange.    This intermediate Java programming book provides Java programmers with the information and tools needed to create your own IM client and server software. You can use the software to create your own IM systems or integrate IM features into your existing software. Imagine allowing your customers to chat directly with technical support or other users from within your application!    This book focuses on the open source Jabber XML-based IM protocols (www.jabber.org) to create Java IM software. These open protocols allows your IM software to seamlessly communicate with the large number of other Jabber clients and servers available including commercial Jabber systems like the one that powers Disney's go.com IM.    Readers are assumed to know how to program in Java. No prior knowledge of Jabber or IM is needed.",
      "status": "PUBLISH",
      "authors": [
        "Iain Shigeoka"
      ],
      "categories": [
        "Internet",
        "Java"
      ],
      "price": 210.8015527156253
    },
    {
      "title": "Java Applets and Channels Without Programming",
      "isbn": "1884777392",
      "pageCount": 372,
      "publishedDate": {
        "$date": "1999-12-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/shoffner.jpg",
      "shortDescription": "Java Applets and Channels Without Programming collects almost 100 applets on a CD with detailed instructions on how to use each applet. In addition, style issues are discussed in detail; not only will you learn how to use each applet, you will learn when and where it is appropriate to use each applet. The book also introduces the new concept of channels and shows how these can be used on your web site as well.  ",
      "longDescription": "If you want to use Java to enhance your Web site, you have two choices: you can write the Java applet yourself or you can find an already written Java applet that meets your needs. If you prefer not to do the writing yourself, then Java Applets and Channels Without Programming is for you. It collects almost 100 applets on a CD with detailed instructions on how to use each applet. In addition, style issues are discussed in detail; not only will you learn how to use each applet, you will learn when and where it is appropriate to use each applet. The book also introduces the new concept of channels and shows how these can be used on your web site as well.    The CD-ROM also contains an exclusive applet configuration utility, a program that allows you to configure the Java applets on the CD-ROM in a WYSIWYG (What You See Is What You Get) environment. When using the utility to configure Java applets, you do not need to know any Java programming or even any HTML programming. All you do is change the value of a parameter and click on a button to see the resulting change to the applet. The applet configuration utility is written in Java and runs in your browser, so it runs on any computer platform for which there is a Java-enabled browser.    The CD-ROM also provides example web pages for more than 60 of the included applets, so you can learn how to use the applets in real-world situations.",
      "status": "PUBLISH",
      "authors": [
        "Ronny Richardson",
        "Michael Shoffner",
        "Marq Singer",
        "Bruce Murray",
        "",
        "Jack Gambol"
      ],
      "categories": [
        "Java"
      ],
      "price": 846.5606674812008
    },
    {
      "title": "PowerShell in Practice",
      "isbn": "1935182005",
      "pageCount": 500,
      "publishedDate": {
        "$date": "2010-06-08T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/siddaway.jpg",
      "shortDescription": "PowerShell in Practice is a hands-on, cookbook-style reference intended for administrators wanting to learn and use PowerShell. Written from an administrator's perspective, it concentrates on using PowerShell for practical tasks and automation. The book starts with an introduction that includes a rapid tutorial and a review of the key areas in which you'll use PowerShell.",
      "longDescription": "Whether you're optimizing performance, automating tasks, or exploiting software features, efficiency is the key to a system administrator's success. Anything that saves a few cycles is a welcome addition to your toolbox; Windows PowerShell has the potential to change the game entirely.    Windows PowerShell is a new scripting language written from the ground up with the goal of simplifying Windows system administration. It's fully aware of the Windows platform and is tightly integrated with key server technologies like Exchange, IIS, SQL Server. PowerShell borrows many ideas from the Unix scripting world, so it's instantly familiar to anyone who has scripted in Bash or another Unix shell. It's also a first-class programming language that supports everything from single-line commands to full-featured Windows programs.    PowerShell in Practice is a hands-on, cookbook-style reference intended for administrators wanting to learn and use PowerShell. Written from an administrator's perspective, it concentrates on using PowerShell for practical tasks and automation. The book starts with an introduction that includes a rapid tutorial and a review of the key areas in which you'll use PowerShell.    This book is written to answer the question \"How can PowerShell make my job as an administrator easier \" After you have your feet under you, you'll find an assortment of practical techniques presented in a Problem/Solution format.    The first major part, called Working with People, addresses user accounts, mailboxes, and desktop configuration and maintenance. The second major part, Working with Servers, offers techniques for DNS, Active Directory, Exchange, IIS, and more.",
      "status": "PUBLISH",
      "authors": [
        "Richard Siddaway"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 787.9797392349193
    },
    {
      "title": "PowerShell and WMI",
      "isbn": "1617290114",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-04-30T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/siddaway2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Richard Siddaway"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 843.6746331758395
    },
    {
      "title": "Making Sense of Java",
      "isbn": "132632942",
      "pageCount": 180,
      "publishedDate": {
        "$date": "1996-06-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/simpson.jpg",
      "shortDescription": "Making Sense of Java clearly and concisely explains the concepts, features, benefits, potential, and limitations of Java.",
      "longDescription": "The meteoric rise of interest in Java, and the simultaneous rise in Java-related hype, make this book's no-nonsense evaluation essential reading for all levels of professionals, from managers to programmers. Making Sense of Java clearly and concisely explains the concepts, features, benefits, potential, and limitations of Java. It is not a programmer's how-to guide and assumes little technical knowledge, though software developers will find this lucid overview to be a valuable introduction to the possible uses and capabilities of Java.",
      "status": "PUBLISH",
      "authors": [
        "Bruce Simpson",
        "John Mitchell",
        "Brian Christeson",
        "Rehan Zaidi",
        "",
        "Jonathan Levine"
      ],
      "categories": [
        "Java",
        "Business"
      ],
      "price": 822.951889100205
    },
    {
      "title": "C++/CLI in Action",
      "isbn": "1932394818",
      "pageCount": 416,
      "publishedDate": {
        "$date": "2007-04-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sivakumar.jpg",
      "shortDescription": "   ... a great resource, an outstanding job, a must-read...        Ayman B. Shoukry, VC++ Team, Microsoft Corporation",
      "longDescription": "Developers initially welcomed Microsoft   s Managed C++ for .NET, but the twisted syntax made it difficult to use. Its much-improved replacement, C++/CLI, now provides an effective bridge between the native and managed programming worlds. Using this technology, developers can combine existing C++ programs and .NET applications with little or no refactoring. Accessing .NET libraries like Windows Forms, WPF, and WCF from standard C++ is equally easy.    C++/CLI in Action is a practical guide that will help you breathe new life into your legacy C++ programs. The book begins with a concise C++/CLI tutorial. It then quickly moves to the key themes of native/managed code interop and mixed-mode programming. You   ll learn to take advantage of GUI frameworks like Windows Forms and WPF while keeping your native C++ business logic. The book also covers methods for accessing C# or VB.NET components and libraries. Written for readers with a working knowledge of C++.",
      "status": "PUBLISH",
      "authors": [
        "Nishant Sivakumar"
      ],
      "categories": [
        "Microsoft"
      ],
      "price": 249.8553072245
    },
    {
      "title": "C# in Depth",
      "isbn": "1933988363",
      "pageCount": 424,
      "publishedDate": {
        "$date": "2008-04-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/skeet.jpg",
      "longDescription": "In programming, there's no substitute for knowing your stuff. In versions 2 and 3, C# introduces new concepts such as lambda expressions and implicit typing that make the language more flexible and give you more power. Using Language INtegrated Query (LINQ)   also new in C# 3   you can interact with data of any type directly from C#. Simply put, mastering these features will make you a more valuable C# developer.    C# in Depth is designed to bring you to a new level of programming skill. It dives deeply into key C# topics   in particular the new ones. You'll learn to reuse algorithms in a type-safe way with C# 2 generics and expand the functionality of existing classes and interfaces using C# 3 extension methods. Tricky issues become clear in author Jon Skeet's crisp, easy-to-follow explanations and snappy, pragmatic examples. With this book under your belt, you will easily learn   and then master   new frameworks and platforms.",
      "status": "PUBLISH",
      "authors": [
        "Jon Skeet"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 103.02424012798372
    },
    {
      "title": "C# in Depth, Second Edition",
      "isbn": "1935182471",
      "pageCount": 584,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/skeet2.jpg",
      "shortDescription": "C# in Depth, Second Edition concentrates on the high-value features that make C# such a powerful and flexible development tool. Rather than re-hashing the core of C# that's essentially unchanged since it hit the scene nearly a decade ago, this book brings you up to speed with the features and practices that have changed with C# from version 2.0 onwards.",
      "longDescription": "C# has changed since it was first introduced   a lot! With generics, lambda expressions, dynamic typing, LINQ, iterator blocks and many other features, C# is more expressive than ever. However, you can't get the most out of the language unless you know it in depth.    C# in Depth, Second Edition concentrates on the high-value features that make C# such a powerful and flexible development tool. Rather than re-hashing the core of C# that's essentially unchanged since it hit the scene nearly a decade ago, this book brings you up to speed with the features and practices that have changed with C# from version 2.0 onwards.    This totally revamped Second Edition is bang up to date, covering the new features of C# 4 as well as Code Contracts. In it, you'll master the subtleties of C#, learning how to tame the trickier bits and apply them to best advantage. Along the way you'll find out how to avoid hidden pitfalls and go \"behind the scenes\" to ensure you don't get nasty surprises.",
      "status": "PUBLISH",
      "authors": [
        "Jon Skeet"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 245.54861870475597
    },
    {
      "title": "Magical A-Life Avatars",
      "isbn": "1884777589",
      "pageCount": 450,
      "publishedDate": {
        "$date": "2000-12-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/small.jpg",
      "shortDescription": "\"Distinctive book explaining how to get intelligent software agents to work.\" --Clipcode.com",
      "longDescription": "Here's a book guaranteed to inspire your creativity and get you looking at the Internet and the World Wide Web with new eyes. Modeling its vision on evolutionary biology, Magical A-Life Avatars uses the example environment of Macromedia Director to create:    imaginative Intranets  original Internet services and applications  new approaches to e-commerce and distance learning  smart agents and Internet robots  brain-like processing modules for adaptation and learning  novel forms of information processing  Magical A-Life Avatars shows, with practical examples, how to bring intelligence to your Website and create Internet interfaces that will increase your competitive advantage. If you're interested in cutting-edge website design and application, this book is for you.",
      "status": "PUBLISH",
      "authors": [
        "Peter Small"
      ],
      "categories": [
        "Internet",
        "Theory"
      ],
      "price": 689.3220641449511
    },
    {
      "title": "Becoming Agile",
      "isbn": "1933988258",
      "pageCount": 408,
      "publishedDate": {
        "$date": "2009-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/smith.jpg",
      "shortDescription": "   Becoming Agile is not another book to be classified in the existing ones handling agile practices, it's one of the rare writings which will go with you in the adoption and setup/migration to an agile process...This real must-have agilist's bedside book reads very well and will accompany you in your migration agile practices...       Eric Siber, Developpez.com",
      "longDescription": "Agile principles have been a breath of fresh air to many development teams stuck in the middle of a rigid, process-driven environment. Unfortunately, it's not so easy to bring Agile into an existing organization with established people and practices. Becoming Agile shows you practical techniques and strategies to move from your existing process to an Agile process without starting from scratch.    Many books discuss Agile from a theoretical or academic perspective. Becoming Agile takes a different approach and focuses on explaining Agile from a ground-level point-of-view. Author Greg Smith, a certified ScrumMaster with dozens of Agile projects under his belt, presents Agile principles in the context of a case study that flows throughout the book.    Becoming Agile focuses on the importance of adapting Agile principles to the realities of your environment. While Agile purists have often discouraged a    partial-Agile    approach, the reality is that in many shops a    purist    approach simply isn't a viable option. Over the last few years, Agile authorities have begun to discover that the best deployments of Agile are often customized to the specific situation of a given company.  As well, Becoming Agile addresses the cultural realities of deploying Agile and how to deal with the needs of executives, managers, and the development team during migration. The author discusses employee motivation and establishing incentives that reward support of Agile techniques.    Becoming Agile will show you how to create a custom Agile process that supports the realities of your environment. The process will minimize risk as you transition to Agile iteratively, allowing time for your culture and processes to acclimate to Agile principles.",
      "status": "PUBLISH",
      "authors": [
        "Greg Smith",
        "Ahmed Sidky"
      ],
      "categories": [
        "Software Engineering"
      ],
      "price": 102.84335397700262
    },
    {
      "title": "ActiveMQ in Action",
      "isbn": "1933988940",
      "pageCount": 408,
      "publishedDate": {
        "$date": "2011-03-31T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/snyder.jpg",
      "shortDescription": "ActiveMQ is implemented in Java, but it supports client applications written in many other programming languages including C/C++, .NET, Ruby, Perl, PHP, Python, and more. It can be integrated with other open source frameworks including Tomcat, ServiceMix, JBoss, and can easily bridge to other JMS providers.  ",
      "longDescription": "Modern distributed architectures require a secure, reliable way to exchange messages in asynchronous, loosely-coupled systems. For Java developers, the Java Message Service (JMS) provides that core functionality. The Apache ActiveMQ message broker is a complete open source implementation of the JMS specification. The ActiveMQ Message-Oriented Middleware, coupled with its Enterprise Integration Provider are the building blocks of an Enterprise Service Bus   the backbone of a contemporary Service Oriented Architecture.    ActiveMQ is implemented in Java, but it supports client applications written in many other programming languages including C/C++, .NET, Ruby, Perl, PHP, Python, and more. It can be integrated with other open source frameworks including Tomcat, ServiceMix, JBoss, and can easily bridge to other JMS providers.    Apache ActiveMQ in Action is a thorough, practical guide to implementing message-oriented systems in Java using ActiveMQ. The book lays out the core of ActiveMQ in clear language, starting with the anatomy of a JMS message and moving quickly through connectors, message persistence, authentication and authorization. With the basics well in hand, you move into interesting examples of ActiveMQ at work, following a running Stock Portfolio application. You'll integrate ActiveMQ with containers like Geronimo and JBoss and learn to tie into popular Java-based technologies like Spring Framework.    Along the way, you'll pick up best practices forged out of the deep experience the authors bring to the book. You'll learn to integrate with non-Java technologies and explore advanced topics like broker topologies and configuration and performance tuning.    Additionally, the book will introduce readers to using Apache Camel with Apache ActiveMQ as a way to easily utilize the Enterprise Integration Patterns.",
      "status": "PUBLISH",
      "authors": [
        "Bruce Snyder",
        "Dejan Bosanac",
        "",
        "Rob Davies"
      ],
      "categories": [
        "Java"
      ],
      "price": 342.01586137820715
    },
    {
      "title": "Implementing PeopleSoft Financials",
      "isbn": "138411808",
      "pageCount": 220,
      "publishedDate": {
        "$date": "1997-01-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/stephens.jpg",
      "shortDescription": "Implementing PeopleSoft Financials discusses the issues that arise and the pitfalls to avoid. Every member of the implementation team--from entry-level accounting clerk through MIS staff to executive sponsors--will benefit from reading this book.",
      "longDescription": "The PeopleSoft promise is enticing: Here's a way for your company to implement a complete and flexible financial infrastructure in a client/server environment without the burdens of low-level programming. But, implementation remains complex and requires reengineering of the business processes and cultures of the using organizations. The author, an experienced implementor of PeopleSoft systems, discusses the issues that arise and the pitfalls to avoid. Every member of the implementation team--from entry-level accounting clerk through MIS staff to executive sponsors--will benefit from reading this book. The views it contains, coming from an independent authority, will also prove useful to those who are considering adopting PeopleSoft for their companies.",
      "status": "PUBLISH",
      "authors": [
        "Early Stephens"
      ],
      "categories": [
        "Business",
        "Client-Server"
      ],
      "price": 151.51612976533335
    },
    {
      "title": "SQL Server DMVs in Action",
      "isbn": "1935182730",
      "pageCount": 352,
      "publishedDate": {
        "$date": "2011-05-09T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/stirk.jpg",
      "shortDescription": "SQL Server DMVs in Action shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The over 100 code examples help you master DMVs and give you an instantly reusable SQL library. You'll also learn to use Dynamic Management Functions (DMFs), which provide further details that enable you to improve your system's performance and health.",
      "longDescription": "SQL Server DMVs in Action is a practical guide that shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The samples provided in this book will help you master DMVs and also give you a tested, working, and instantly reusable SQL code library.    Every action in SQL Server leaves a set of tiny footprints. SQL Server records that valuable data and makes it visible through Dynamic Management Views, or DMVs. You can use this incredibly detailed information to significantly improve the performance of your queries and better understand what's going on inside your SQL Server system.    SQL Server DMVs in Action shows you how to obtain, interpret, and act on the information captured by DMVs to keep your system in top shape. The over 100 code examples help you master DMVs and give you an instantly reusable SQL library. You'll also learn to use Dynamic Management Functions (DMFs), which provide further details that enable you to improve your system's performance and health.",
      "status": "PUBLISH",
      "authors": [
        "Ian W. Stirk"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 454.614760888955
    },
    {
      "title": "Scala in Depth",
      "isbn": "1935182706",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-05-14T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/suereth.jpg",
      "shortDescription": "Scala in Depth is a unique new book designed to help you integrate Scala effectively into your development process. By presenting the emerging best practices and designs from the Scala community, it guides you though dozens of powerful techniques example by example. There's no heavy-handed theory here-just lots of crisp, practical guides for coding in Scala.    For example:        * Discover the \"sweet spots\" where object-oriented and functional programming intersect.      * Master advanced OO features of Scala, including type member inheritance, multiple inheritance and composition.      * Employ functional programming concepts like tail recursion, immutability, and monadic operations.      * Learn good Scala style to keep your code concise, expressive and readable.    As you dig into the book, you'll start to appreciate what makes Scala really shine. For instance, the Scala type system is very, very powerful; this book provides use case approaches to manipulating the type system and covers how to use type constraints to enforce design constraints. Java developers love Scala's deep integration with Java and the JVM Ecosystem, and this book shows you how to leverage it effectively and work around the rough spots.",
      "longDescription": "Scala is a unique and powerful new programming language for the JVM. Blending the strengths of the Functional and Imperative programming models, Scala is a great tool for building highly concurrent applications without sacrificing the benefits of an OO approach. While information about the Scala language is abundant, skilled practitioners, great examples, and insight into the best practices of the community are harder to find. Scala in Depth bridges that gap, preparing you to adopt Scala successfully for real world projects.    Scala in Depth is a unique new book designed to help you integrate Scala effectively into your development process. By presenting the emerging best practices and designs from the Scala community, it guides you though dozens of powerful techniques example by example. There's no heavy-handed theory here-just lots of crisp, practical guides for coding in Scala.    For example:        * Discover the \"sweet spots\" where object-oriented and functional programming intersect.      * Master advanced OO features of Scala, including type member inheritance, multiple inheritance and composition.      * Employ functional programming concepts like tail recursion, immutability, and monadic operations.      * Learn good Scala style to keep your code concise, expressive and readable.    As you dig into the book, you'll start to appreciate what makes Scala really shine. For instance, the Scala type system is very, very powerful; this book provides use case approaches to manipulating the type system and covers how to use type constraints to enforce design constraints. Java developers love Scala's deep integration with Java and the JVM Ecosystem, and this book shows you how to leverage it effectively and work around the rough spots.",
      "status": "PUBLISH",
      "authors": [
        "Joshua D. Suereth"
      ],
      "categories": [
        "Java"
      ],
      "price": 667.3978531959816
    },
    {
      "title": "JMX in Action",
      "isbn": "1930110561",
      "pageCount": 424,
      "publishedDate": {
        "$date": "2002-09-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sullins.jpg",
      "longDescription": "With Java Management Extensions (JMX), you can configure, manage and monitor your Java applications at run-time, as well as break your applications into components that can be swapped out. JMX provides a window into an application's state and its behavior, and a protocol-independent way of altering both state and behavior. It lets you expose portions of your application in just a few lines of code.    Written for both new and experienced developers, this book explains the JMX specification and discusses its use through clean, well-discussed examples. It covers the JMX architecture and how to create all types of MBeans. It includes important advanced topics such as extending the JMX classes, combining with other Java technologies, the MBean relation service, dynamic MBean loading, and creating your own protocol adapters.",
      "status": "PUBLISH",
      "authors": [
        "Benjamin G. Sullins",
        "Mark B. Whipple"
      ],
      "categories": [
        "Java"
      ],
      "price": 521.2471912585402
    },
    {
      "title": "EJB Cookbook",
      "isbn": "1930110944",
      "pageCount": 352,
      "publishedDate": {
        "$date": "2003-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sullins2.jpg",
      "shortDescription": "\"This book provides a great reference for the average EJB developer. It provides recipes for most common tasks that an EJB developer would need.\" -- Computing Reviews, Nov. 2003",
      "longDescription": "The EJB Cookbook is a resource for the practicing EJB developer. It is a systematic collection of EJB 'recipes'. Each recipe describes a practical problem and its background; it then shows the code that  solves it, and ends with a detailed discussion.    This unique book is written for developers who want quick, clean, solutions to frequent problems--or simply EJB development ideas. Easy to find recipes range from the common to the advanced. How do you secure a message-driven bean  How do you generate EJB code  How can you improve your entity bean persistence layer ",
      "status": "PUBLISH",
      "authors": [
        "Benjamin G. Sullins",
        "Mark B. Whipple"
      ],
      "categories": [
        "Java"
      ],
      "price": 469.25572657313876
    },
    {
      "title": "GWT in Action, Second Edition",
      "isbn": "1935182846",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-01-21T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tacy.jpg",
      "status": "PUBLISH",
      "authors": [
        "Adam Tacy",
        "Robert Hanson",
        "Jason Essington",
        "",
        "Anna Tkke"
      ],
      "categories": [
        "Java"
      ],
      "price": 188.48226082889985
    },
    {
      "title": "JUnit in Action, Second Edition",
      "isbn": "1935182021",
      "pageCount": 504,
      "publishedDate": {
        "$date": "2010-07-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tahchiev.jpg",
      "shortDescription": "JUnit in Action, Second Edition is an up-to-date guide to unit testing Java applications (including Java EE applications) using the JUnit framework and its extensions. This book provides techniques for solving real-world problems such as testing AJAX applications, using mocks to achieve testing isolation, in-container testing for Java EE and database applications, and test automation.",
      "longDescription": "When JUnit was first introduced a decade ago by Kent Beck and Erich Gamma, the Agile movement was in its infancy, \"Test Driven Development\" was unknown, and unit testing was just starting to move into the typical developer's vocabulary. Today, most developers acknowledge the benefits of unit testing and rely on the increasingly sophisticated tools now available. The recently released JUnit 4.5 represents the state of the art in unit testing frameworks, and provides significant new features to improve the Java development process.    JUnit in Action, Second Edition is an up-to-date guide to unit testing Java applications (including Java EE applications) using the JUnit framework and its extensions. This book provides techniques for solving real-world problems such as testing AJAX applications, using mocks to achieve testing isolation, in-container testing for Java EE and database applications, and test automation.    Written to help readers exploit JUnit 4.5, the book covers recent innovations such as the new annotations that simplify test writing, improved exception handling, and the new assertion methods. You'll also discover how to use JUnit extensions to test new application styles and frameworks including Ajax, OSGi, and HTML-based presentation layers.    Using a sample-driven approach, various unit testing strategies are covered, such as how to unit test EJBs, database applications, and web applications. Also addressed are testing strategies using freely available open source frameworks and tools, and how to unit test in isolation with Mock Objects. The book will also bring you up to speed on the latest thinking in TDD, BDD, Continuous Integration, and other practices related to unit testing.  ",
      "status": "PUBLISH",
      "authors": [
        "Petar Tahchiev",
        "Felipe Leme",
        "Vincent Massol",
        "",
        "Gary Gregory"
      ],
      "categories": [
        "Java"
      ],
      "price": 564.0138201459501
    },
    {
      "title": "Bitter Java",
      "isbn": "193011043X",
      "pageCount": 368,
      "publishedDate": {
        "$date": "2002-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tate.jpg",
      "longDescription": "It is a well-known fact that most software projects fail. Drawing important lessons from common failures is the goal of Bitter Java.    Reusing design patterns is not enough for success: patterns are like partial maps of dangerous terrain. They help, but don't prevent you from getting lost. Bitter Java teaches you how to recognize when you are lost, and how to get back on the right path. It illustrates common pitfalls of Java programming through code examples; it then refactors the code and explains why the new solutions are safe.    This book is a systematic account of common server-side Java programming mistakes, their causes and solutions. It covers antipatterns for base Java and J2EE concepts such as Servlets, JSPs, EJBs, enterprise connection models, and scalability. If you are an intermediate Java programmer, analyst or architect eager to avoid the bitter experiences of others, this book is for you.",
      "status": "PUBLISH",
      "authors": [
        "Bruce A. Tate"
      ],
      "categories": [
        "Java",
        "Business",
        "Client Server",
        ""
      ],
      "price": 774.7345447828225
    },
    {
      "title": "Bitter EJB",
      "isbn": "1930110952",
      "pageCount": 440,
      "publishedDate": {
        "$date": "2003-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/tate2.jpg",
      "shortDescription": "\"The book's informal tone offers a refreshing change from the ubiquitous preachiness of other EJB tomes. It's pragmatic and doesn't tap dance around the fact that EJBs are often used incorrectly in enterprise development... it's an effective way to avoid the potholes that have forced developers off track in the past.\" -- Software Development Magazine",
      "longDescription": "In Bitter EJB, Bruce Tate and his co-authors continue the entertaining and engaging writing style of relating true-life adventure sport experiences to antipattern themes established in Bruce's first book, the best selling Bitter Java.    This more advanced book explores antipatterns, or common traps, within the context of EJB technology.    EJB is experiencing the mixture of practical success and controversy that accompanies a new and quickly-changing framework. Bitter EJB takes the swirling EJB controversies head-on. It offers a practical approach to design: how to become a better programmer by studying problems and solutions to the most important problems surrounding the technology.    The flip side of design patterns, antipatterns, are a fun and interesting way to take EJB expertise to the next level. The book covers many different aspects of EJB, from transactions to persistence to messaging, as well as performance and testing.    Bitter EJB will teach programmers to do the following:    Identify EJB persistence strategies  Choose Entity bean alternatives  Use EJB message driven beans  Know when to apply or avoid stateful session beans  Create efficient build strategies with XDoclet, Ant and JUnit  Automate performance tuning",
      "status": "PUBLISH",
      "authors": [
        "Bruce Tate",
        "Mike Clark",
        "Bob Lee",
        "Patrick Linskey"
      ],
      "categories": [
        "Java",
        "Internet"
      ],
      "price": 542.8502395773613
    },
    {
      "title": "Spring Batch in Action",
      "isbn": "1935182951",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2011-10-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/templier.jpg",
      "status": "PUBLISH",
      "authors": [
        "Arnaud Cogoluegnes",
        "Thierry Templier",
        "Gary Gregory",
        "Olivier Bazoud"
      ],
      "categories": [
        "In Action"
      ],
      "price": 757.1109000111285
    },
    {
      "title": "JDK 1.4 Tutorial",
      "isbn": "1930110456",
      "pageCount": 408,
      "publishedDate": {
        "$date": "2002-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/travis.jpg",
      "longDescription": "Java is a success. It is now used across the programming landscape, from embedded devices to enterprise-class distributed systems. As Java's use increases, the pressure grows for it to expand to meet the diverse needs of the developer communities. The latest edition of Java, JDK 1.4 (or J2SE 1.4), includes new features like a new I/O system, a persistent preferences framework, Java Web Start, and Java regular expressions.    This book lets experienced developers as well as novices learn JDK 1.4's new features quickly. It provides a clear exposition of the important new topics with plenty of well documented code. All the examples are substantial and solve real-world problems but aren't cluttered with unnecessary details. The new features are covered in a comprehensive and matter-of-fact way without digressions into philosophy or theory. After reading this book, a developer will be able to use Java's new features with confidence and skill.",
      "status": "PUBLISH",
      "authors": [
        "Gregory M. Travis"
      ],
      "categories": [
        "Java",
        "Internet"
      ],
      "price": 628.1647588575426
    },
    {
      "title": "iPhone and iPad in Action",
      "isbn": "1935182587",
      "pageCount": 450,
      "publishedDate": {
        "$date": "2010-08-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/trebitowski.jpg",
      "shortDescription": "Using many examples, the book covers core features like accelerometers, GPS, the Address Book, and much more. Along the way, you'll learn to leverage your iPhone skills to build attractive iPad apps. This is a revised and expanded edition of the original iPhone in Action.",
      "longDescription": "This hands-on tutorial will help you master iPhone/iPad development using the native iPhone SDK. It guides you from setting up dev tools like Xcode and Interface Builder, through coding your first app, all the way to selling in the App Store.    Using many examples, the book covers core features like accelerometers, GPS, the Address Book, and much more. Along the way, you'll learn to leverage your iPhone skills to build attractive iPad apps. This is a revised and expanded edition of the original iPhone in Action.",
      "status": "PUBLISH",
      "authors": [
        "Brandon Trebitowski",
        "Christopher Allen",
        "",
        "Shannon Appelcline"
      ],
      "categories": [
        "Mobile Technology"
      ],
      "price": 223.72059167641711
    },
    {
      "title": "SQL Server 2005 Reporting Services in Action",
      "isbn": "1932394761",
      "pageCount": 600,
      "publishedDate": {
        "$date": "2006-11-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/updegraff.jpg",
      "longDescription": "Reports are the lifeline of business, so a good reporting environment is a big deal. With a powerful tool like Microsoft Reporting Services, .NET developers can add reporting to any type of application, regardless of its target platform or development language. Greatly improved for SQL Server 2005, Reporting Services now provides tighter integration with SQL Server, improved developer tools, and an expanded array of options to empower end users.    SQL Server 2005 Reporting Services in Action helps you build and manage flexible reporting solutions and develop report-enabled applications. In this clear, well-illustrated book, you  ll follow a report from creation to publication. Along the way you  ll explore flexible delivery options like web-based, on-demand, and subscribed reports   complete with cool new features like direct printing and client-side sorting.    For applications that require custom reporting, you'll learn to define reports with RDL and push them to the Report Server using the Report Manager Web Service API. You  ll also see how to write server extensions to expand the range of data processing and report delivery options.    Written for developers with a solid foundation in .NET and SQL Server.",
      "status": "PUBLISH",
      "authors": [
        "Bret Updegraff"
      ],
      "categories": [
        "Microsoft"
      ],
      "price": 789.6474989479218
    },
    {
      "title": "Ten Years of UserFriendly.Org",
      "isbn": "1935182129",
      "pageCount": 1096,
      "publishedDate": {
        "$date": "2008-12-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/userfriendly.jpg",
      "shortDescription": "This unique collector's volume includes every daily strip from November 17, 1997 to November 16, 2007. Many of the cartoons are annotated with comments from UserFriendly artist and creator JD    Illiad    Frazer.",
      "longDescription": "For over 10 years, UserFriendly has been entertaining geeks of all stripes with its daily dose of humor, social commentary, and occasionally absurd observations about the world of technology. Loyal UserFriendly fans   UFies   have been asking for a Big Book of UserFriendly that assembles the first decade of UserFriendly   almost 4,000 individual comics   in a single volume. Manning has teamed up with the folks at UserFriendly.Org to bring you exactly that!    This unique collector's volume includes every daily strip from November 17, 1997 to November 16, 2007. Many of the cartoons are annotated with comments from UserFriendly artist and creator JD    Illiad    Frazer.",
      "status": "PUBLISH",
      "authors": [
        "JD \"Illiad\" Frazer"
      ],
      "categories": [
        "Miscellaneous"
      ],
      "price": 162.383062273876
    },
    {
      "title": "Graphics Programming with Perl",
      "isbn": "1930110022",
      "pageCount": 328,
      "publishedDate": {
        "$date": "2002-05-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/verbruggen.jpg",
      "longDescription": "An increasing number of tasks in application programming and web design requires creating and manipulating graphics. Perl is a powerful and flexible language that is not commonly associated with graphics programming. The speed of developing in Perl plus the large number of freely available Perl graphics modules, make it an excellent option for the rapid development of graphics applications.    Graphics Programming with Perl is a guide to the graphics and imaging modules and tools available to the Perl programmer. It covers subjects ranging from drawing your own pictures and dynamic graphics for web pages to rendering three-dimensional scenes and manipulating individual image pixels. The text is liberally illustrated with example code and programs that show how to achieve common, and sometimes not so common, graphics programming tasks. For the even less common tasks, the book shows you how to write your own modules.",
      "status": "PUBLISH",
      "authors": [
        "Martien Verbruggen"
      ],
      "categories": [
        "Computer Graphics",
        "Perl"
      ],
      "price": 546.4053639860826
    },
    {
      "title": "RabbitMQ in Action",
      "isbn": "1935182978",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-04-20T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/videla.jpg",
      "status": "PUBLISH",
      "authors": [
        "Alvaro Videla",
        "Jason J.W. Williams"
      ],
      "categories": [
        "Software Engineering"
      ],
      "price": 967.2898453732786
    },
    {
      "title": "XDoclet in Action",
      "isbn": "1932394052",
      "pageCount": 624,
      "publishedDate": {
        "$date": "2003-11-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls.jpg",
      "longDescription": "Are you tired of writing the same Java code, over and over again  XDoclet will take the burden of repetitive development tasks off your shoulders by automating them. XDoclet is a metadata-driven, code generation engine for Java. Starting from simple JavaDoc-style comments, it generates deployment descriptors, interfaces, framework classes and other utility classes your project requires.    XDoclet in Action is an easy to read introduction to XDoclet and its uses. It is a resource on code generation with this popular open source tool. With many short code examples and a full-scale J2EE example, the book shows you how to use XDoclet with EJBs, Servlets, JMX, and other technologies. You'll also learn how to customize XDoclet beyond its out-of-the-box capabilities to generate code specific to your application.    With this book you will learn how to write less code, how to keep your application components in sync, and how to keep your deployment, interface, utility and other information all in one place.",
      "status": "PUBLISH",
      "authors": [
        "Craig Walls",
        "Norman Richards"
      ],
      "categories": [
        "XML",
        "Java"
      ],
      "price": 55.42951191074863
    },
    {
      "title": "Spring in Action",
      "isbn": "1932394354",
      "pageCount": 472,
      "publishedDate": {
        "$date": "2005-02-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls2.jpg",
      "shortDescription": "Spring in Action introduces you to the ideas behind Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems using the leading open-source tools, and also how to integrate your application with the most popular web frameworks. You will learn how to use Spring to manage the bulk of your infrastructure code so you can focus on what really matters     your critical business needs.",
      "longDescription": "Spring is a fresh breeze blowing over the Java landscape. Based on a design principle called Inversion of Control, Spring is a powerful but lightweight J2EE framework that does not require the use of EJBs. Spring greatly reduces the complexity of using interfaces, and speeds and simplifies your application development. You get the power and robust features of EJB and get to keep the simplicity of the non-enterprise JavaBean.    Spring in Action introduces you to the ideas behind Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems using the leading open-source tools, and also how to integrate your application with the most popular web frameworks. You will learn how to use Spring to manage the bulk of your infrastructure code so you can focus on what really matters     your critical business needs.",
      "status": "PUBLISH",
      "authors": [
        "Craig Walls",
        "Ryan Breidenbach"
      ],
      "categories": [
        "Java"
      ],
      "price": 54.687972909202685
    },
    {
      "title": "Spring in Action, Second Edition",
      "isbn": "1933988134",
      "pageCount": 768,
      "publishedDate": {
        "$date": "2007-08-01T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls3.jpg",
      "longDescription": "Spring is a fresh breeze blowing over the Java landscape. Based on the principles of dependency injection, interface-oriented design, and aspect-oriented programming, Spring combines enterprise application power with the simplicity of plain-old Java objects (POJOs).    In this second edition, Spring in Action has been completely updated to cover the exciting new features of Spring 2.0. The book begins by introducing you to the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications. You will see how to solve persistence problems, handle asynchronous messaging, create and consume remote services, build web applications, and integrate with most popular web frameworks. You will learn how to use Spring to write simpler, easier to maintain code so that you can focus on what really matters--your critical business needs.",
      "status": "PUBLISH",
      "authors": [
        "Craig Walls with Ryan Breidenbach"
      ],
      "categories": [
        "Java"
      ],
      "price": 1.5658141750880539
    },
    {
      "title": "Spring in Action, Third Edition",
      "isbn": "1935182358",
      "pageCount": 424,
      "publishedDate": {
        "$date": "2011-06-21T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls4.jpg",
      "shortDescription": "Spring in Action, Third Edition has been completely revised to reflect the latest features, tools, practices Spring offers to java developers. It begins by introducing the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications.",
      "longDescription": "A few years back, Spring arrived as is a fresh breeze blowing over the Java landscape. Based on the principles of dependency injection, interface-oriented design, and aspect-oriented programming, Spring combines enterprise application power with the simplicity of plain-old Java objects (POJOs). Now, Spring has grown into a full suite of technologies, including dedicated projects for integration, OSGI-based development, and more.    Spring in Action, Third Edition has been completely revised to reflect the latest features, tools, practices Spring offers to java developers. It begins by introducing the core concepts of Spring and then quickly launches into a hands-on exploration of the framework. Combining short code snippets and an ongoing example developed throughout the book, it shows you how to build simple and efficient J2EE applications.    Inside, you'll see how to:    Solve persistence problems  Handle asynchronous messaging  Create and consume remote services  Build web applications  Integrate with most popular web frameworks  In short, you'll learn how to use Spring to write simpler, easier to maintain code so that you can focus on what really matters   your critical business needs.    The revised Third Edition explores the core Spring Framework issues, as well as the latest updates to other Spring portfolio projects such as Spring WebFlow and Spring Security. The result is a book that's both broader and deeper than previous editions. You'll learn the full range of new features available with Spring 3, including:    More annotation-oriented options to reduce the amount of XML configuration  Full-featured support for REST  A new Spring Expression Language (SpEL) that makes short work of wiring complex values.  Examples that illustrate the current best practices developed in the Spring community.  This book assumes that you know your way around Java, but no previous experience with Spring is required.",
      "status": "PUBLISH",
      "authors": [
        "Craig Walls"
      ],
      "categories": [
        "Java"
      ],
      "price": 152.31456262796806
    },
    {
      "title": "Spring in Practice",
      "isbn": "1935182056",
      "pageCount": 600,
      "publishedDate": {
        "$date": "2013-05-09T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wheeler.jpg",
      "shortDescription": "Spring in Practice diverges from other cookbooks because it presents the background you need to understand the domain in which a solution applies before it offers the specific steps to solve the problem. You're never left with the feeling that you understand the answer, but find the question irrelevant. You can put the book to immediate use even if you don't have deep knowledge of every part of Spring Framework.",
      "longDescription": "For enterprise Java developers, Spring Framework provides remarkable improvements in developer productivity, runtime performance, and overall application quality. Its unique blend of a complete, lightweight container that allows you to build a complex application from loosely-coupled POJOs and a set of easily understood abstractions that simplify construction, testing, and deployment make Spring both powerful and easy-to-use   a hard-to-beat combination. With this power comes the potential for a wide range of uses in both common and not-so-common scenarios. That's where Spring in Practice comes in.    Unlike the many books that teach you what Spring is, Spring in Practice shows you how to tackle the challenges you face when you build Spring-based applications. The book empowers software developers to solve concrete business problems \"the Spring way\" by mapping application-level issues to Spring-centric solutions.    Spring in Practice diverges from other cookbooks because it presents the background you need to understand the domain in which a solution applies before it offers the specific steps to solve the problem. You're never left with the feeling that you understand the answer, but find the question irrelevant. You can put the book to immediate use even if you don't have deep knowledge of every part of Spring Framework.    The book divides into three main parts. In Part 1, you'll get a rapid overview of Spring Framework   enough to get you started if you're new and a great refresher for readers who already have a few Spring cycles. Part 2 provides techniques that are likely to be useful no matter what type of application you're building. You'll find discussions of topics like user accounts, security, site navigation, and application diagnosis.    Part 3 provides domain-specific recipes. Here, you'll find practical solutions to realistic and interesting business problems. For example, this part discusses Spring-based approaches for ecommerce, lead generation, and CRM.    There are several recurring themes throughout Spring in Practice, including Spring MVC, Hibernate, and transactions. Each recipe is an opportunity to highlight something new or interesting about Spring, and to focus on that concept in detail.    This book assumes you have a good foundation in Java and Java EE. Prior exposure to Spring Framework is helpful, but not required.",
      "status": "PUBLISH",
      "authors": [
        "Willie Wheeler with Joshua White"
      ],
      "categories": [
        "Java",
        "Software Development"
      ],
      "price": 542.8837148410131
    },
    {
      "title": "Java 2 Micro Edition",
      "isbn": "1930110332",
      "pageCount": 504,
      "publishedDate": {
        "$date": "2002-03-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/white.jpg",
      "longDescription": "Java2, Micro Edition (J2ME) is a technology defined by many specifications. These specifications help J2ME address the diverse needs of this wide spectrum of consumer products. This guide describes the architecture of J2ME and demonstrates the various specifications for programming Java applications.    Through the use of a tutorial application and various programming examples, the common elements of most applications, namely user interface, event handling, data storage, networking, and input/output are examined. Also covered are design considerations when building software for resource-constrained devices as well as J2ME competition and associated technologies in these devices.    Tutorial and API example application source code downloads will be available from this site.",
      "status": "PUBLISH",
      "authors": [
        "James P. White",
        "David A. Hemphill"
      ],
      "categories": [
        "Java",
        "Internet"
      ],
      "price": 648.808722436067
    },
    {
      "title": "SharePoint 2010 Workflows in Action",
      "isbn": "1935182714",
      "pageCount": 360,
      "publishedDate": {
        "$date": "2011-02-07T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wicklund.jpg",
      "shortDescription": "SharePoint 2010 Workflows in Action is a hands-on guide for workflow application development in SharePoint. Power users are introduced to the simplicity of building and integrating workflows using SharePoint Designer, Visio, InfoPath, and Office. Developers will learn to build custom processes and use external data sources. They will learn about state machine workflows, ASP.NET forms, event handlers, and much more. This book requires no previous experience with workflow app development. ",
      "longDescription": "You can use SharePoint 2010 workflows to transform a set of business processes into working SharePoint applications. For that task, a power user gets prepackaged workflows, wizards, and design tools, and a programmer benefits from Visual Studio to handle advanced workflow requirements.    SharePoint 2010 Workflows in Action is a hands-on guide for workflow application development in SharePoint. Power users are introduced to the simplicity of building and integrating workflows using SharePoint Designer, Visio, InfoPath, and Office. Developers will learn to build custom processes and use external data sources. They will learn about state machine workflows, ASP.NET forms, event handlers, and much more. This book requires no previous experience with workflow app development. ",
      "status": "PUBLISH",
      "authors": [
        "Phil Wicklund"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 823.7409582407118
    },
    {
      "title": "SharePoint 2010 Web Parts in Action",
      "isbn": "1935182773",
      "pageCount": 448,
      "publishedDate": {
        "$date": "2011-04-24T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wilen.jpg",
      "shortDescription": "SharePoint 2010 Web Parts in Action is a comprehensive guide to deploying, customizing, and creating Web Parts. Countless examples walk you through everything from design, to development, deployment, troubleshooting, and upgrading. Because Web Parts are ASP.NET controls, you'll learn to use Visual Studio 2010 to extend existing Web Parts and to build custom components from scratch. ",
      "longDescription": "If you look at a SharePoint application you'll find that most of its active components are Web Parts. SharePoint 2010 includes dozens of prebuilt Web Parts that you can use. It also provides an API that lets you build custom Web Parts using C# or VB.NET.    SharePoint 2010 Web Parts in Action is a comprehensive guide to deploying, customizing, and creating Web Parts. Countless examples walk you through everything from design, to development, deployment, troubleshooting, and upgrading. Because Web Parts are ASP.NET controls, you'll learn to use Visual Studio 2010 to extend existing Web Parts and to build custom components from scratch. ",
      "status": "PUBLISH",
      "authors": [
        "Wictor Wiln"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 677.4562418377461
    },
    {
      "title": "C++ Concurrency in Action",
      "isbn": "1933988770",
      "pageCount": 325,
      "publishedDate": {
        "$date": "2012-02-24T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/williams.jpg",
      "shortDescription": "C++ Concurrency in Action is the first book to show you how to take advantage of the new C++ Standard and TR2 to write robust multi-threaded applications in C++.",
      "longDescription": "It seems like we're all being asked to multi-task more than ever   and our computers are no exception to this trend. Multiple processors with multiple cores running multiple threads is quickly becoming the norm. C++ developers will have to master the principles, techniques, and new language features supporting concurrency to stay ahead of the curve.    With the new C++ Standard and Technical Report 2 (TR2), multi-threading is coming to C++ in a big way. There is a new memory model with support for multiple threads, along with a new multi-threading support library featuring low-level atomic operations, as well as basic thread launching and synchronization facilities. TR2 will provide higher-level synchronization facilities that allow for a much greater level of abstraction, and make programming multi-threaded applications simpler and safer.    C++ Concurrency in Action is the first book to show you how to take advantage of the new C++ Standard and TR2 to write robust multi-threaded applications in C++.    As a guide and reference to the new concurrency features in the upcoming C++ Standard and TR, this book is invaluable for existing programmers familiar with writing multi-threaded code in C++ using platform-specific APIs, or in other languages, as well as C++ programmers who have never written multi-threaded code before.    If you're a programmer accustomed to writing single-threaded applications, C++ Concurrency in Action will show you how to write your new parallel algorithm in C++. You'll learn to avoid many of the pitfalls associated with writing multi-threaded applications. You can also use this book to quickly transfer your platform-specific knowledge to the new Standard C++ threading library, enabling you to use a single API on both systems and simplify your code.",
      "status": "PUBLISH",
      "authors": [
        "Anthony Williams"
      ],
      "categories": [
        "Microsoft .NET"
      ],
      "price": 827.4956552114999
    },
    {
      "title": "Java Servlets by Example",
      "isbn": "188477766X",
      "pageCount": 550,
      "publishedDate": {
        "$date": "2002-12-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/williamson.jpg",
      "longDescription": "Although CGI scripts provide 80% of today's server side processing, they are slow, inefficient, and memory-hungry. A new species is evolving to take their place, one which is lean, fast, portable, and easy to maintain: Java servlets.    Servlets are not merely an alternative to CGI, for they can do much more. Servlets have opened the door to a world of client/server applications that would have been too difficult or too time-consuming to consider before.    Java Servlets: By Example takes the reader into the world of servlets, moving example by example from the simple to the complex. An early chapter explains the simple HTML form processing through servlets. A later chapter shows how to connect a Java applet to a servlet, which is itself connected to a database.    Java Servlets: By Example is full of real-world, ready-to-run example code. Each chapter deals with a new problem and takes the reader through a series of servlet-based solutions. However, the book is detailed enough that it may also serve as a reference for the developer.",
      "status": "PUBLISH",
      "authors": [
        "Alan R. Williamson"
      ],
      "categories": [
        "Java",
        "Internet"
      ],
      "price": 500.7870190468713
    },
    {
      "title": "XML Programming with VB and ASP",
      "isbn": "1884777872",
      "pageCount": 320,
      "publishedDate": {
        "$date": "1999-12-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wilson.jpg",
      "longDescription": "Here's a book that shows you when and how to use XML from both a programming and business perspective. Laden with source code, XML Programming with VB and ASP helps you build solutions that are flexible, future-proof, and self-describing. It will help you apply XML concepts between the client and the server and the server and data objects or data services.    Finally, you have everything a VB and ASP developer needs to keep up with the explosive growth of XML.",
      "status": "PUBLISH",
      "authors": [
        "Mark Wilson",
        "Tracey Wilson"
      ],
      "categories": [
        "XML",
        "Internet"
      ],
      "price": 467.2532251435315
    },
    {
      "title": "Oracle8i Database Administration",
      "isbn": "1884777783",
      "pageCount": 543,
      "publishedDate": {
        "$date": "1999-11-01T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/yuhanna.jpg",
      "longDescription": "Databases are growing larger, and the use of distributed databases is on the rise. Oracle8i Database Administration addresses some of the most common yet complex issues that are faced by DBAs around the world.    Oracle has the largest market share in Database Management software and is the world's second largest software company. This book is designed for for Oracle Database administrators and others who are involved in planning, programming, administration, and implementation of Oracle8 Databases.    Although this book targets intermediate and advanced database administrators, it can also be an invaluable resource to entry-level DBAs, designers and developers, project managers, system administrators, data warehousing professionals or anyone interested in Oracle.    Oracle8i Database Administration uses a Q&A approach that provides in-depth technical solutions. The questions in this book have been compiled from many sources including Oracle forums, the Internet, and the author's personal experiences. The book also examines features that are new in Oracle8.",
      "status": "PUBLISH",
      "authors": [
        "Noel Yuhanna"
      ],
      "categories": [
        "Client-Server",
        "Networking"
      ],
      "price": 47.94084835857526
    },
    {
      "title": "The Engaging Web",
      "isbn": "9781935182078",
      "pageCount": 325,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/zichermann.jpg",
      "shortDescription": "The Engaging Web: How Fun and Games Improve Your Site shows web developers how to incorporate games into websites. This book will help you decode the possibilities and provide a series of proven and tangible strategies that any web developer, producer, or product manager can use to implement games in their website. Whether you're looking to make games the centerpiece of your site, an added-value feature, or you just want to engage and excite your users, The Engaging Web will help you develop a strategy that harnesses the power of games.",
      "longDescription": "Games are the fastest-growing and stickiest form of entertainment. For a website, games offer powerful potential to acquire new users, build engagement, and enhance revenue. Implementing games in a website can be complicated, though. There are hundreds of technical and process options to choose from, and the landscape is constantly shifting.    The Engaging Web: How Fun and Games Improve Your Site shows web developers how to incorporate games into websites. This book will help you decode the possibilities and provide a series of proven and tangible strategies that any web developer, producer, or product manager can use to implement games in their website. Whether you're looking to make games the centerpiece of your site, an added-value feature, or you just want to engage and excite your users, The Engaging Web will help you develop a strategy that harnesses the power of games.    Through this book, you will take away an in-depth understanding of the current state of the art in game and web planning and integration methodologies. It begins by presenting an understanding of basic \"funware\" principles - or how non-designers can use games to further business objectives. Powerful funware designs like frequent flyer programs, casino games, and leaderboard/ladders will be deconstructed and componentized so that you can leverage their strengths for your specific site and business objectives.    You'll then investigate the three basic recipes for melding games with the web, and look at specific examples of integration approaches that have been successfully deployed across various industries. Finally, you'll examine social networking considerations and look at code examples.    Whether you're building a business or consumer site, games and funware design can be a powerful weapon in your battle for user engagement, stickiness, and revenue. The Engaging Web is the field guide that gives you the best tactics, techniques, and strategies for winning the war.    WHAT'S INSIDE        * Understanding funware and game design      * Principal funware designs: casinos frequent flyer programs, leaderboards      * Matching games to your business objectives      * Recipes for implementing games on your site      * Games, social networking and you      * Code examples",
      "status": "MEAP",
      "authors": [
        "Gabe Zichermann",
        "Chris Cunningham"
      ],
      "categories": [
        "Web Development"
      ],
      "price": 566.8893953691559
    },
    {
      "title": "Enterprise OSGi In Action",
      "isbn": "1617290130",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cummins.jpg",
      "status": "PUBLISH",
      "authors": [
        "Holly Cummins",
        "Timothy Ward"
      ],
      "categories": [],
      "price": 200.15128627554145
    },
    {
      "title": "Ext JS in Action, Second Edition",
      "isbn": "1617290327",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-02-04T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/garcia3.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jesus Garcia",
        "Grgur Grisogono",
        "",
        "Jacob K. Andresen"
      ],
      "categories": [],
      "price": 106.32547415071426
    },
    {
      "title": "Android in Action, Third Edition",
      "isbn": "1617290505",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2011-11-15T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ableson3.jpg",
      "status": "PUBLISH",
      "authors": [
        "W. Frank Ableson",
        "Robi Sen",
        "Chris King",
        "C. Enrique Ortiz"
      ],
      "categories": [],
      "price": 713.123395359482
    },
    {
      "title": "Arduino in Action",
      "isbn": "1617290246",
      "pageCount": 300,
      "publishedDate": {
        "$date": "2013-05-30T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mevans.jpg",
      "shortDescription": "Arduino in Action is a hands-on guide to prototyping and building electronics using the Arduino platform. Suitable for beginners and advanced users, this easy to follow book begins with the basics and systematically guides you through projects ranging from your first blinking LED through connecting Arduino to devices like game controllers or your iPhone.",
      "longDescription": "Whether you want to build an autonomous robot, automate your home electronics, or just automatically tweet when the bread is ready, you can do it with Arduino. Arduino is an inexpensive, easy-to-use, open source hardware and software platform. It supports a mind-boggling array of sensors and components that you can use to build nearly anything you can imagine.\n\nArduino in Action is a hands-on guide to prototyping and building electronics using the Arduino platform. Suitable for beginners and advanced users, this easy to follow book begins with the basics and systematically guides you through projects ranging from your first blinking LED through connecting Arduino to devices like game controllers or your iPhone.\n\nYou'll start at the very beginning: unpacking your first Arduino board, connecting it to a PC, and using the programming environment to make something happen. You'll follow progressively more complex examples as you connect your Arduino to motors, LCD displays, Wi-Fi, GPS, and Bluetooth. You'll explore a variety of input output sensors, including ultrasound, infrared, and light, along with how to use them for tasks like robotic obstacle avoidance.",
      "status": "PUBLISH",
      "authors": [
        "Martin Evans",
        "Joshua Noble",
        "",
        "Jordan Hochenbaum"
      ],
      "categories": [],
      "price": 223.36346870255542
    },
    {
      "title": "Node.js in Action",
      "isbn": "1617290572",
      "pageCount": 300,
      "publishedDate": {
        "$date": "2013-10-15T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/cantelon.jpg",
      "shortDescription": "Node.js in Action is an example-driven tutorial that starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. You'll start by learning how to set up your Node development environment, including loading the community-created extensions. Next, you'll run several simple demonstration programs where you'll learn the basics of a few common types of Node applications. Then you'll dive into asynchronous programming, a model Node leverages to lessen application bottlenecks.",
      "longDescription": "JavaScript on the server? Yep. Node.js is an elegant server-side JavaScript development environment perfect for scalable, high-performance web applications. With Node you access HTTP and TCP/IP functionality through a minimalist server-side Javascript interface. It supports an asynchronous programming model that enables the web server to more easily do more than one thing at a time, a key requirement for real-time applications such as chat, online games, and live statistics. And since it's JavaScript, you'll use the same language throughout your entire application.\n\nNode.js in Action is an example-driven tutorial that starts at square one and guides you through all the features, techniques, and concepts you'll need to build production-quality Node applications. You'll start by learning how to set up your Node development environment, including loading the community-created extensions. Next, you'll run several simple demonstration programs where you'll learn the basics of a few common types of Node applications. Then you'll dive into asynchronous programming, a model Node leverages to lessen application bottlenecks.\n\nWith the basics under your belt, you're ready to start building serious web applications using Node's HTTP API. You'll explore data storage, application deployment, and output templating, and you'll discover community frameworks that make web development easier and faster. Along the way, you'll learn to interact with the filesystem and to create non-HTTP applications, such as TCP/IP servers and command-line tools.\n\nMuch of the Node ecosystem is open source, so this book will show you how the community works and how you can contribute. You'll learn about the NPM Repository, where most community extensions reside, and you'll learn how to publish your own extensions. In addition, the book outlines online resources for getting help with any stumbling blocks you run into during your journey as a Node developer.\nWHAT'S INSIDE",
      "status": "PUBLISH",
      "authors": [
        "Mike Cantelon",
        "Marc Harter",
        "T.J. Holowaychuk",
        "",
        "Nathan Rajlich"
      ],
      "categories": [
        "Web Development"
      ],
      "price": 889.9479417359477
    },
    {
      "title": "Third-Party JavaScript ",
      "isbn": "1617290548",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-03-11T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/vinegar.jpg",
      "status": "PUBLISH",
      "authors": [
        "Ben Vinegar",
        "Anton Kovalyov"
      ],
      "categories": [],
      "price": 190.23286286128905
    },
    {
      "title": "Multimedia Computing",
      "isbn": "020152029X",
      "pageCount": 0,
      "publishedDate": {
        "$date": "1993-09-01T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Matthew E. Hodges"
      ],
      "categories": [],
      "price": 160.42983273153231
    },
    {
      "title": "Web Development with JavaServer Pages",
      "isbn": "1884777996",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2000-05-15T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Duane K. Fields",
        "Mark A. Kolb"
      ],
      "categories": [],
      "price": 751.8126786821091
    },
    {
      "title": "Up to Speed with Swing",
      "isbn": "1884777643",
      "pageCount": 0,
      "publishedDate": {
        "$date": "1998-05-01T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Steven J. Gutz"
      ],
      "categories": [],
      "price": 663.6307539973121
    },
    {
      "title": "Manager's Guide to Open Source",
      "isbn": "193239429X",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2004-10-01T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Maria Winslow"
      ],
      "categories": [],
      "price": 6.383705984426058
    },
    {
      "title": "Programming Web Services with Java",
      "isbn": "1930110421",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2002-10-01T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Ajamu A. Wesley"
      ],
      "categories": [],
      "price": 767.4042490346455
    },
    {
      "title": "TCP/IP Programming for OS/2",
      "isbn": "132612496",
      "pageCount": 0,
      "publishedDate": {
        "$date": "1996-04-23T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Steven J. Gutz"
      ],
      "categories": [],
      "price": 818.5668429081272
    },
    {
      "title": "SCWCD Exam Study Kit",
      "isbn": "1930110596",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2002-07-01T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "Hanumant Deshmukh",
        "Jignesh Malavia"
      ],
      "categories": [],
      "price": 260.7578703040692
    },
    {
      "title": "Unit Testing in C++",
      "isbn": "1617290386",
      "pageCount": 0,
      "status": "PUBLISH",
      "authors": [
        "Bruce Trask",
        "Angel Roman"
      ],
      "categories": [],
      "price": 460.9559650087067
    },
    {
      "title": "Big Data",
      "isbn": "1617290343",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/marz.jpg",
      "status": "MEAP",
      "authors": [
        "Nathan Marz",
        "James Warren"
      ],
      "categories": [],
      "price": 110.82746489973493
    },
    {
      "title": "CoffeeScript in Action",
      "isbn": "1617290629",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-05-09T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lee.jpg",
      "status": "PUBLISH",
      "authors": [
        "Patrick Lee"
      ],
      "categories": [],
      "price": 824.6537117569356
    },
    {
      "title": "SQL Server MVP Deep Dives, Volume 2",
      "isbn": "1617290475",
      "pageCount": 750,
      "publishedDate": {
        "$date": "2011-10-13T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/delaney.jpg",
      "status": "PUBLISH",
      "authors": [
        "Kalen Delaney",
        "Louis Davidson",
        "Greg Low",
        "Brad McGehee",
        "Paul Nielsen",
        "Paul Randal",
        "",
        "Kimberly Tripp"
      ],
      "categories": [],
      "price": 800.2129809921477
    },
    {
      "title": "HTML5 in Action",
      "isbn": "1617290491",
      "pageCount": 375,
      "publishedDate": {
        "$date": "2014-02-10T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/crowther2.jpg",
      "shortDescription": "HTML5 In Action provides a complete introduction to web development using HTML5. You'll explore every aspect of the HTML5 specification through real-world examples and code samples. It's much more than just a specification reference, though. It lives up to the name HTML5 in Action by giving you the practical, hands-on guidance you'll need to use key features.",
      "longDescription": "The Web is buzzing about HTML5. What is it? Which browsers support what features? When the specification will be complete? HTML5, along with supporting technologies like CSS3, SVG, and JavaScript, gives web developers powerful new features like local storage, better audio and video support, and standards-driven mobile application development. And it's ready to use now, with browser support from Microsoft, Google, Apple, Mozilla, and Opera.\n\nHTML5 In Action provides a complete introduction to web development using HTML5. You'll explore every aspect of the HTML5 specification through real-world examples and code samples. It's much more than just a specification reference, though. It lives up to the name HTML5 in Action by giving you the practical, hands-on guidance you'll need to use key features like:\n\n    * The new semantic elements and form input types\n    * Native multimedia playback with the video and audio elements\n    * Canvas and 2D drawing APIs\n    * Offline applications\n    * Local and session storage, IndexedDB databases\n    * Web workers\n    * Geolocation, File API, History API\n    * Cross-document Message API\n    * Much, much more\n\nWith this book, you can confidently start using HTML5 today. The relevant, easy-to-follow examples will make you a HTML5 master in no time. You'll even learn how to provide fallbacks for browsers that don't support particular HTML5 features.",
      "status": "PUBLISH",
      "authors": [
        "Rob Crowther",
        "Joe Lennon",
        "Ash Blue",
        "",
        "Greg Wanish"
      ],
      "categories": [],
      "price": 382.1807494693157
    },
    {
      "title": "Java Persistence with Hibernate, Second Edition",
      "isbn": "1617290459",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bauer3.jpg",
      "status": "MEAP",
      "authors": [
        "Christian Bauer",
        "Gavin King",
        "",
        "Gary Gregory"
      ],
      "categories": [],
      "price": 782.9136128439889
    },
    {
      "title": "Hadoop in Practice",
      "isbn": "1617290238",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-10-02T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/holmes.jpg",
      "status": "PUBLISH",
      "authors": [
        "Alex Holmes"
      ],
      "categories": [],
      "price": 942.2761614019379
    },
    {
      "title": "HBase in Action",
      "isbn": "1617290521",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-11-02T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dimidukkhurana.jpg",
      "status": "PUBLISH",
      "authors": [
        "Nicholas Dimiduk",
        "Amandeep Khurana"
      ],
      "categories": [],
      "price": 718.4715935615737
    },
    {
      "title": "Flex Mobile in Action",
      "isbn": "1617290610",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-05-30T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/campos.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jonathan Campos"
      ],
      "categories": [],
      "price": 567.1188644961607
    },
    {
      "title": "HTML5 for .NET Developers",
      "isbn": "1617290432",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-11-30T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jackson.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jim Jackson",
        "II",
        "Ian Gilman"
      ],
      "categories": [],
      "price": 322.10546206420855
    },
    {
      "title": "50 Android Hacks",
      "isbn": "1617290564",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-06-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sessa.jpg",
      "status": "PUBLISH",
      "authors": [
        "Carlos M. Sessa"
      ],
      "categories": [],
      "price": 416.87675280853153
    },
    {
      "title": "PowerShell in Depth",
      "isbn": "1617290556",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-02-20T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Don Jones",
        "Richard Siddaway",
        "",
        "Jeffery Hicks"
      ],
      "categories": [],
      "price": 657.1475942457772
    },
    {
      "title": "Augmented Reality Revealed",
      "isbn": "1617290165",
      "pageCount": 0,
      "status": "MEAP",
      "authors": [
        "Robert A. Rice Jr."
      ],
      "categories": [],
      "price": 939.5272964720893
    },
    {
      "title": "Building Well-Structured JavaScript Applications",
      "isbn": "1617290599",
      "pageCount": 0,
      "status": "MEAP",
      "authors": [
        "Julio C. Ody"
      ],
      "categories": [],
      "price": 104.98526802703356
    },
    {
      "title": "Linked Data",
      "isbn": "1617290394",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-12-31T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dwood.jpg",
      "status": "PUBLISH",
      "authors": [
        "David Wood",
        "Marsha Zaidman",
        "Luke Ruth",
        "with Michael Hausenblas"
      ],
      "categories": [],
      "price": 910.2089420913288
    },
    {
      "title": "Mule in Action, Second Edition",
      "isbn": "1617290823",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-02-20T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/dossot2.jpg",
      "status": "PUBLISH",
      "authors": [
        "David Dossot",
        "John D'Emic",
        "",
        "Victor Romero"
      ],
      "categories": [],
      "price": 111.74582665264099
    },
    {
      "title": "Single Page Web Applications",
      "isbn": "1617290750",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-09-19T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mikowski.jpg",
      "status": "PUBLISH",
      "authors": [
        "Michael S. Mikowski",
        "Josh C. Powell"
      ],
      "categories": [],
      "price": 270.21320942162987
    },
    {
      "title": "The Art of Unit Testing, Second Edition",
      "isbn": "1617290890",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-11-25T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/osherove2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Roy Osherove"
      ],
      "categories": [],
      "price": 632.2085822169577
    },
    {
      "title": "Play for Java",
      "isbn": "1617290904",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-03-14T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/leroux.jpg",
      "status": "PUBLISH",
      "authors": [
        "Nicolas Leroux",
        "Sietse de Kaper"
      ],
      "categories": [],
      "price": 700.9904792079482
    },
    {
      "title": "Hello World! Second Edition",
      "isbn": "1617290920",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-12-12T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sande2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Warren Sande",
        "Carter Sande"
      ],
      "categories": [],
      "price": 601.488655126269
    },
    {
      "title": "Dart in Action",
      "isbn": "1617290866",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-12-31T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/buckett.jpg",
      "status": "PUBLISH",
      "authors": [
        "Chris Buckett"
      ],
      "categories": [],
      "price": 439.1298717345109
    },
    {
      "title": "Redis in Action",
      "isbn": "1617290858",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-06-18T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/carlson.jpg",
      "status": "PUBLISH",
      "authors": [
        "Josiah Carlson"
      ],
      "categories": [],
      "price": 4.725326151178599
    },
    {
      "title": "Using the TI-83 Plus/TI-84 Plus",
      "isbn": "161729084X",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-08-19T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mitchell2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Christopher R. Mitchell"
      ],
      "categories": [],
      "price": 256.9247710536591
    },
    {
      "title": "Neo4j in Action",
      "isbn": "1617290769",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/partner.jpg",
      "status": "MEAP",
      "authors": [
        "Jonas Partner",
        "Aleksa Vukotic",
        "",
        "Nicki Watt"
      ],
      "categories": [],
      "price": 34.54807780596014
    },
    {
      "title": "Programming the TI-83 Plus/TI-84 Plus",
      "isbn": "1617290777",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-09-14T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mitchell.jpg",
      "status": "PUBLISH",
      "authors": [
        "Christopher R. Mitchell"
      ],
      "categories": [],
      "price": 970.9075324075733
    },
    {
      "title": "Functional Programming in Scala",
      "isbn": "1617290653",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bjarnason.jpg",
      "status": "MEAP",
      "authors": [
        "Paul Chiusano",
        "Rnar Bjarnason"
      ],
      "categories": [],
      "price": 528.1086524029847
    },
    {
      "title": "Play for Scala",
      "isbn": "1617290793",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-10-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hilton.jpg",
      "status": "PUBLISH",
      "authors": [
        "Peter Hilton",
        "Erik Bakker",
        "",
        "Francisco Canedo"
      ],
      "categories": [],
      "price": 189.6446120007831
    },
    {
      "title": "Node.js in Practice",
      "isbn": "1617290939",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/templier2.jpg",
      "status": "MEAP",
      "authors": [
        "Alex Young",
        "Marc Harter"
      ],
      "categories": [],
      "price": 140.52016487373842
    },
    {
      "title": "SonarQube in Action",
      "isbn": "1617290955",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-10-30T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/papapetrou.jpg",
      "status": "PUBLISH",
      "authors": [
        "G. Ann Campbell",
        "Patroklos P. Papapetrou"
      ],
      "categories": [],
      "price": 657.6825059751559
    },
    {
      "title": "Windows Store App Development: C# and XAML",
      "isbn": "1617290947",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-06-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pbrown3.jpg",
      "status": "PUBLISH",
      "authors": [
        "Peter M. Brown"
      ],
      "categories": [],
      "price": 383.3048238971517
    },
    {
      "title": "Learn Windows IIS in a Month of Lunches",
      "isbn": "1617290971",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-12-31T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/helmick.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jason C. Helmick"
      ],
      "categories": [],
      "price": 824.2976784111681
    },
    {
      "title": "Mondrian in Action",
      "isbn": "161729098X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/back.jpg",
      "status": "PUBLISH",
      "authors": [
        "William Back",
        "Nicholas Goodman",
        "",
        "Julian Hyde"
      ],
      "categories": [],
      "price": 779.986317517069
    },
    {
      "title": "RabbitMQ in Depth",
      "isbn": "1617291005",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/roy.jpg",
      "status": "MEAP",
      "authors": [
        "Gavin M. Roy"
      ],
      "categories": [],
      "price": 918.3493851177875
    },
    {
      "title": "Akka in Action",
      "isbn": "1617291013",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/roestenburg.jpg",
      "status": "MEAP",
      "authors": [
        "Raymond Roestenburg",
        "Rob Bakker",
        "Rob Williams",
        "Steven Haines"
      ],
      "categories": [],
      "price": 718.4473999548278
    },
    {
      "title": "Extending jQuery",
      "isbn": "161729103X",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-08-12T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/wood.jpg",
      "status": "PUBLISH",
      "authors": [
        "Keith B. Wood"
      ],
      "categories": [],
      "price": 914.5477669867001
    },
    {
      "title": "OCA Java SE 7 Programmer I Certification Guide",
      "isbn": "1617291048",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-04-02T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gupta.jpg",
      "status": "PUBLISH",
      "authors": [
        "Mala Gupta"
      ],
      "categories": [],
      "price": 110.81388670848536
    },
    {
      "title": "Kanban in Action",
      "isbn": "1617291056",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-03-04T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hammarberg.jpg",
      "status": "PUBLISH",
      "authors": [
        "Marcus Hammarberg",
        "Joakim Sunden"
      ],
      "categories": [],
      "price": 509.18942136154135
    },
    {
      "title": "Solr in Action",
      "isbn": "1617291021",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-03-25T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/grainger.jpg",
      "status": "PUBLISH",
      "authors": [
        "Trey Grainger",
        "Timothy Potter"
      ],
      "categories": [],
      "price": 835.066353790977
    },
    {
      "title": "Making Sense of NoSQL",
      "isbn": "1617291072",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-09-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mccreary.jpg",
      "status": "PUBLISH",
      "authors": [
        "Daniel G. McCreary",
        "Ann M. Kelly"
      ],
      "categories": [],
      "price": 455.7162687218419
    },
    {
      "title": "Jaguar Development with PowerBuilder 7",
      "isbn": "1884777864",
      "pageCount": 0,
      "publishedDate": {
        "$date": "1999-08-09T00:00:00.000-0700"
      },
      "status": "PUBLISH",
      "authors": [
        "MIchael Barlotta"
      ],
      "categories": [],
      "price": 847.6136296856007
    },
    {
      "title": "Grails in Action, Second Edition",
      "isbn": "1617290963",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gsmith2.jpg",
      "status": "MEAP",
      "authors": [
        "Glen Smith",
        "Peter Ledbrook"
      ],
      "categories": [],
      "price": 216.99233159688157
    },
    {
      "title": "Rails 4 in Action",
      "isbn": "1617291099",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bigg2.jpg",
      "status": "MEAP",
      "authors": [
        "Ryan Bigg",
        "Yehuda Katz",
        "and Steve Klabnik",
        ""
      ],
      "categories": [],
      "price": 600.0619488407082
    },
    {
      "title": "Learn Windows PowerShell in a Month of Lunches, Second Edition",
      "isbn": "1617291080",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-11-12T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones3.jpg",
      "status": "PUBLISH",
      "authors": [
        "Don Jones",
        "Jeffery D. Hicks"
      ],
      "categories": [],
      "price": 285.33386024823824
    },
    {
      "title": "AOP in .NET",
      "isbn": "1617291145",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-06-21T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/groves.jpg",
      "status": "PUBLISH",
      "authors": [
        "Matthew D. Groves"
      ],
      "categories": [],
      "price": 818.7369113127081
    },
    {
      "title": "Learn PowerShell Toolmaking in a Month of Lunches",
      "isbn": "1617291161",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2012-12-12T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones4.jpg",
      "status": "PUBLISH",
      "authors": [
        "Don Jones",
        "Jeffery Hicks"
      ],
      "categories": [],
      "price": 740.6675988153635
    },
    {
      "title": "CMIS and Apache Chemistry in Action",
      "isbn": "1617291153",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mueller.jpg",
      "status": "PUBLISH",
      "authors": [
        "Florian Mller",
        "Jay Brown",
        "Jeff Potts"
      ],
      "categories": [],
      "price": 975.8120280643914
    },
    {
      "title": "Action Guide (aka VB .NET)",
      "isbn": "1930110324",
      "pageCount": 0,
      "status": "PUBLISH",
      "authors": [
        "Paul Messick"
      ],
      "categories": [],
      "price": 380.1016980374869
    },
    {
      "title": "Learn Active Directory Management in a Month of Lunches",
      "isbn": "1617291196",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/siddaway3.jpg",
      "status": "PUBLISH",
      "authors": [
        "Richard Siddaway"
      ],
      "categories": [],
      "price": 540.8698408695549
    },
    {
      "title": "Spring in Action, Fourth Edition",
      "isbn": "161729120X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/walls5.jpg",
      "status": "MEAP",
      "authors": [
        "Craig Walls"
      ],
      "categories": [],
      "price": 115.1179029839271
    },
    {
      "title": "The Mikado Method",
      "isbn": "1617291218",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-03-05T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ellnestam.jpg",
      "status": "PUBLISH",
      "authors": [
        "Ola Ellnestam",
        "Daniel Brolund"
      ],
      "categories": [],
      "price": 865.818535283643
    },
    {
      "title": "The Responsive Web",
      "isbn": "1617291242",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/carver.jpg",
      "status": "MEAP",
      "authors": [
        "Matthew Carver"
      ],
      "categories": [],
      "price": 601.4839825887717
    },
    {
      "title": "Fast ASP.NET Websites",
      "isbn": "1617291250",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-08-29T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hume.jpg",
      "status": "PUBLISH",
      "authors": [
        "Dean Alan Hume"
      ],
      "categories": [],
      "price": 722.1472247075824
    },
    {
      "title": "SBT in Action",
      "isbn": "1617291277",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/suereth2.jpg",
      "status": "MEAP",
      "authors": [
        "Joshua Suereth",
        "Matthew Farwell"
      ],
      "categories": [],
      "price": 180.40061697472188
    },
    {
      "title": "PowerShell Deep Dives",
      "isbn": "1617291315",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hicks.jpg",
      "status": "PUBLISH",
      "authors": [
        "Edited by Jeffery Hicks",
        "Richard Siddaway",
        "Oisin Grehan",
        "",
        "Aleksandar Nikolic"
      ],
      "categories": [],
      "price": 581.8500528193096
    },
    {
      "title": "Gradle in Action",
      "isbn": "1617291307",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-02-18T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/muschko.jpg",
      "status": "PUBLISH",
      "authors": [
        "Benjamin Muschko"
      ],
      "categories": [],
      "price": 903.6856133265154
    },
    {
      "title": "Scalatra in Action",
      "isbn": "1617291293",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/carrero2.jpg",
      "status": "MEAP",
      "authors": [
        "Ivan Porto Carrero",
        "Ross A. Baker",
        "Dave Hrycyszyn",
        "Stefan Ollinger",
        "",
        "Jared Armstrong"
      ],
      "categories": [],
      "price": 535.1719831286248
    },
    {
      "title": "AngularJS in Action",
      "isbn": "1617291331",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bford.jpg",
      "status": "MEAP",
      "authors": [
        "Brian Ford",
        "Lukas Ruebbelke"
      ],
      "categories": [],
      "price": 471.9342098222683
    },
    {
      "title": "Software Development Metrics",
      "isbn": "1617291358",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/nicolette.jpg",
      "status": "MEAP",
      "authors": [
        "David Nicolette"
      ],
      "categories": [],
      "price": 199.20060186836008
    },
    {
      "title": "F# Deep Dives",
      "isbn": "1617291323",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/petricek_trelford.jpg",
      "status": "MEAP",
      "authors": [
        "Tomas Petricek",
        "Phillip Trelford"
      ],
      "categories": [],
      "price": 572.5251253448178
    },
    {
      "title": "C# in Depth, Third Edition",
      "isbn": "161729134X",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-09-19T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/skeet3.jpg",
      "status": "PUBLISH",
      "authors": [
        "Jon Skeet"
      ],
      "categories": [],
      "price": 955.5080332569512
    },
    {
      "title": "PostGIS in Action, Second Edition",
      "isbn": "1617291390",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/obe2.jpg",
      "status": "MEAP",
      "authors": [
        "Regina Obe",
        "Leo Hsu"
      ],
      "categories": [],
      "price": 114.19135109232181
    },
    {
      "title": "R in Action, Second Edition",
      "isbn": "1617291382",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kabacoff2.jpg",
      "status": "MEAP",
      "authors": [
        "Robert Kabacoff"
      ],
      "categories": [],
      "price": 658.0182620457296
    },
    {
      "title": "The Joy of Clojure, Second Edition",
      "isbn": "1617291412",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-05-29T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/fogus2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Michael Fogus",
        "Chris Houser"
      ],
      "categories": [],
      "price": 845.097462439855
    },
    {
      "title": "iOS 7 in Action",
      "isbn": "1617291420",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-04-03T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/lim2.jpg",
      "status": "PUBLISH",
      "authors": [
        "Brendan G. Lim",
        "Martin Conte Mac Donell"
      ],
      "categories": [],
      "price": 58.155631603856726
    },
    {
      "title": "Hello App Inventor!",
      "isbn": "1617291439",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/beer.jpg",
      "status": "MEAP",
      "authors": [
        "Paula Beer",
        "Carl Simmons"
      ],
      "categories": [],
      "price": 303.987456211781
    },
    {
      "title": "Ember.js in Action",
      "isbn": "1617291455",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-06-10T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/skeie.jpg",
      "status": "PUBLISH",
      "authors": [
        "Joachim Haagen Skeie"
      ],
      "categories": [],
      "price": 576.6984003493471
    },
    {
      "title": "Netty in Action",
      "isbn": "1617291471",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/maurer.jpg",
      "status": "MEAP",
      "authors": [
        "Norman Maurer",
        "Courtney Robinson"
      ],
      "categories": [],
      "price": 509.77365530064264
    },
    {
      "title": "RavenDB in Action",
      "isbn": "1617291501",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/syn-hershko.jpg",
      "status": "MEAP",
      "authors": [
        "Itamar Syn-Hershko"
      ],
      "categories": [],
      "price": 369.71978076322773
    },
    {
      "title": "OCP Java SE 7 Programmer II Certification Guide",
      "isbn": "161729148X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/gupta2.jpg",
      "status": "MEAP",
      "authors": [
        "Mala Gupta"
      ],
      "categories": [],
      "price": 997.2251818675941
    },
    {
      "title": "Backbone.js in Action",
      "isbn": "1617291536",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/breed.jpg",
      "status": "MEAP",
      "authors": [
        "Samuel M. Breed",
        "Cole Krumbholz",
        "",
        "Phillip Whisenhunt"
      ],
      "categories": [],
      "price": 361.80901408080433
    },
    {
      "title": "Clojure in Action, Second Edition",
      "isbn": "1617291528",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rathore2.jpg",
      "status": "MEAP",
      "authors": [
        "Amit Rathore"
      ],
      "categories": [],
      "price": 280.8675636535691
    },
    {
      "title": "Practical Data Science with R",
      "isbn": "1617291560",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-04-02T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/zumel.jpg",
      "status": "PUBLISH",
      "authors": [
        "Nina Zumel",
        "John Mount"
      ],
      "categories": [],
      "price": 877.4911145922061
    },
    {
      "title": "ArcGIS Web Development",
      "isbn": "1617291617",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/rubalcava.jpg",
      "status": "MEAP",
      "authors": [
        "Rene Rubalcava"
      ],
      "categories": [],
      "price": 229.69479744047726
    },
    {
      "title": "Elasticsearch in Action",
      "isbn": "1617291625",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hinman.jpg",
      "status": "MEAP",
      "authors": [
        "Radu Gheorghe",
        "Matthew Lee Hinman"
      ],
      "categories": [],
      "price": 547.0335885839812
    },
    {
      "title": "Learn SCCM 2012 in a Month of Lunches",
      "isbn": "1617291684",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bannan.jpg",
      "status": "MEAP",
      "authors": [
        "James Bannan"
      ],
      "categories": [],
      "price": 596.503517799736
    },
    {
      "title": "Programming for Musicians and Digital Artists",
      "isbn": "1617291706",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kapur.jpg",
      "status": "MEAP",
      "authors": [
        "Ajay Kapur",
        "Perry Cook",
        "Spencer Salazar",
        "",
        "Ge Wang"
      ],
      "categories": [],
      "price": 863.42940186966
    },
    {
      "title": "BDD in Action",
      "isbn": "161729165X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/smart.jpg",
      "status": "MEAP",
      "authors": [
        "John F. Smart"
      ],
      "categories": [],
      "price": 500.75146814353855
    },
    {
      "title": "Windows Phone 8 in Action",
      "isbn": "1617291374",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2013-12-31T00:00:00.000-0800"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/binkley.jpg",
      "status": "PUBLISH",
      "authors": [
        "Timothy Binkley-Jones",
        "Massimo Perga",
        "Michael Sync",
        "Adam Benoit"
      ],
      "categories": [],
      "price": 660.6918518004738
    },
    {
      "title": "Titanium Alloy in Action",
      "isbn": "1617291749",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/alcocer.jpg",
      "status": "MEAP",
      "authors": [
        "Ricardo Alcocer"
      ],
      "categories": [],
      "price": 159.60693443448372
    },
    {
      "title": "Giraph in Action",
      "isbn": "1617291757",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/martella.jpg",
      "status": "MEAP",
      "authors": [
        "Claudio Martella",
        "Roman Shaposhnik",
        "",
        "Dionysios Logothetis"
      ],
      "categories": [],
      "price": 59.36533902018937
    },
    {
      "title": "The Well-Grounded Rubyist, Second Edition",
      "isbn": "1617291692",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-06-24T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/black3.jpg",
      "status": "PUBLISH",
      "authors": [
        "David A. Black"
      ],
      "categories": [],
      "price": 445.59578131169707
    },
    {
      "title": "Go in Action",
      "isbn": "1617291781",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/ketelsen.jpg",
      "status": "MEAP",
      "authors": [
        "Brian Ketelsen",
        "Erik St. Martin",
        "",
        "William Kennedy"
      ],
      "categories": [],
      "price": 580.5507794698806
    },
    {
      "title": "The Programmer's Guide to Apache Thrift ",
      "isbn": "1617291811",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/abernethy.jpg",
      "status": "MEAP",
      "authors": [
        "Randy Abernethy"
      ],
      "categories": [],
      "price": 343.5759178692981
    },
    {
      "title": "Grokking Functional Programming",
      "isbn": "1617291838",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/khan.jpg",
      "status": "MEAP",
      "authors": [
        "Aslam Khan"
      ],
      "categories": [],
      "price": 856.7630165468722
    },
    {
      "title": "CORS in Action",
      "isbn": "161729182X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hossain.jpg",
      "status": "MEAP",
      "authors": [
        "Monsur Hossain"
      ],
      "categories": [],
      "price": 572.7656027316287
    },
    {
      "title": "Reactive Design Patterns",
      "isbn": "1617291803",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/kuhn.jpg",
      "status": "MEAP",
      "authors": [
        "Roland Kuhn",
        "Jamie Allen"
      ],
      "categories": [],
      "price": 181.00004253612732
    },
    {
      "title": "Storm Applied",
      "isbn": "1617291897",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pathirana.jpg",
      "status": "MEAP",
      "authors": [
        "Sean Allen",
        "Peter Pathirana",
        "",
        "Matthew Jankowski"
      ],
      "categories": [],
      "price": 284.19970917424143
    },
    {
      "title": "Real-World Machine Learning",
      "isbn": "1617291927",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/brink.jpg",
      "status": "MEAP",
      "authors": [
        "Henrik Brink",
        "Joseph Richards"
      ],
      "categories": [],
      "price": 783.3696222470587
    },
    {
      "title": "jQuery UI in Action",
      "isbn": "1617291935",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/vantoll.jpg",
      "status": "MEAP",
      "authors": [
        "Theodore J. (T.J.) VanToll III"
      ],
      "categories": [],
      "price": 63.74473129555369
    },
    {
      "title": "Web Components in Action",
      "isbn": "1617291943",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/buckett2.jpg",
      "status": "MEAP",
      "authors": [
        "Chris Buckett"
      ],
      "categories": [],
      "price": 10.044437966510777
    },
    {
      "title": "JavaScript Application Design",
      "isbn": "1617291951",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bevacqua.jpg",
      "status": "MEAP",
      "authors": [
        "Nicolas G. Bevacqua"
      ],
      "categories": [],
      "price": 123.0666699167664
    },
    {
      "title": "Git in Practice",
      "isbn": "1617291978",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/mcquaid.jpg",
      "status": "MEAP",
      "authors": [
        "Mike McQuaid"
      ],
      "categories": [],
      "price": 395.4490982853387
    },
    {
      "title": "Impala in Action",
      "isbn": "1617291986",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/saltzer.jpg",
      "status": "MEAP",
      "authors": [
        "Richard L. Saltzer",
        "Istvan Szegedi"
      ],
      "categories": [],
      "price": 482.19359004791085
    },
    {
      "title": "Java 8 in Action",
      "isbn": "1617291994",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/urma.jpg",
      "status": "MEAP",
      "authors": [
        "Raoul-Gabriel Urma",
        "Mario Fusco",
        "",
        "Alan Mycroft"
      ],
      "categories": [],
      "price": 84.41615654999057
    },
    {
      "title": "Elixir in Action",
      "isbn": "161729201X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/juric.jpg",
      "status": "MEAP",
      "authors": [
        "Saa Juric"
      ],
      "categories": [],
      "price": 850.0110765292137
    },
    {
      "title": "MongoDB in Action, Second Edition",
      "isbn": "1617291609",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/banker2.jpg",
      "status": "MEAP",
      "authors": [
        "Kyle Banker",
        "Peter Bakkum",
        "Tim Hawkins",
        "Shaun Verch",
        "",
        "Douglas Garrett"
      ],
      "categories": [],
      "price": 205.68740024751776
    },
    {
      "title": "Getting MEAN with Mongo, Express, Angular, and Node",
      "isbn": "1617292036",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/sholmes.jpg",
      "status": "MEAP",
      "authors": [
        "Simon Holmes"
      ],
      "categories": [],
      "price": 883.3694528316873
    },
    {
      "title": "jQuery in Action, Third Edition",
      "isbn": "1617292079",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/derosa.jpg",
      "status": "MEAP",
      "authors": [
        "Bear Bibeault",
        "Yehuda Katz",
        "",
        "Aurelio De Rosa"
      ],
      "categories": [],
      "price": 18.134095777733616
    },
    {
      "title": "D3.js in Action",
      "isbn": "1617292117",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/meeks.jpg",
      "status": "MEAP",
      "authors": [
        "Elijah Meeks"
      ],
      "categories": [],
      "price": 570.7825965333915
    },
    {
      "title": "Learn SQL Server Administration in a Month of Lunches",
      "isbn": "1617292133",
      "pageCount": 0,
      "publishedDate": {
        "$date": "2014-05-02T00:00:00.000-0700"
      },
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones5.jpg",
      "status": "PUBLISH",
      "authors": [
        "Don Jones"
      ],
      "categories": [],
      "price": 384.70112753782246
    },
    {
      "title": "Geoprocessing with Python",
      "isbn": "1617292141",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/garrard.jpg",
      "status": "MEAP",
      "authors": [
        "Chris Garrard"
      ],
      "categories": [],
      "price": 558.8529703483105
    },
    {
      "title": "Barcodes with iOS",
      "isbn": "161729215X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/drobnik.jpg",
      "status": "MEAP",
      "authors": [
        "Oliver Drobnik"
      ],
      "categories": [],
      "price": 780.9953887556262
    },
    {
      "title": "Chef in Action",
      "isbn": "1617292214",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/aivaliotis.jpg",
      "status": "MEAP",
      "authors": [
        "Dimitri Aivaliotis"
      ],
      "categories": [],
      "price": 519.1886183274866
    },
    {
      "title": "Hadoop in Practice, Second Edition",
      "isbn": "1617292222",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/holmes2.jpg",
      "status": "MEAP",
      "authors": [
        "Alex Holmes"
      ],
      "categories": [],
      "price": 459.4886557460285
    },
    {
      "title": "Oculus Rift in Action",
      "isbn": "1617292192",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bdavis.jpg",
      "status": "MEAP",
      "authors": [
        "Bradley Austin Davis",
        "Karen Bryla",
        "",
        "Alex Benton"
      ],
      "categories": [],
      "price": 628.0818365067369
    },
    {
      "title": "OpenStack in Action",
      "isbn": "1617292168",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/bumgardner.jpg",
      "status": "MEAP",
      "authors": [
        "Cody Bumgardner"
      ],
      "categories": [],
      "price": 777.2677035893198
    },
    {
      "title": "PowerShell in Depth, Second Edition",
      "isbn": "1617292184",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/jones6.jpg",
      "status": "MEAP",
      "authors": [
        "Don Jones",
        "Jeffery Hicks",
        "",
        "Richard Siddaway"
      ],
      "categories": [],
      "price": 627.1339388205641
    },
    {
      "title": "Practical Probabilistic Programming",
      "isbn": "1617292338",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/pfeffer.jpg",
      "status": "MEAP",
      "authors": [
        "Avi Pfeffer"
      ],
      "categories": [],
      "price": 789.0200240323812
    },
    {
      "title": "Unity in Action",
      "isbn": "161729232X",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hocking.jpg",
      "status": "MEAP",
      "authors": [
        "Joseph Hocking"
      ],
      "categories": [],
      "price": 734.6175711013525
    },
    {
      "title": "Express.js in Action",
      "isbn": "1617292427",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/hahn.jpg",
      "status": "MEAP",
      "authors": [
        "Evan M. Hahn"
      ],
      "categories": [],
      "price": 277.82025324599323
    },
    {
      "title": "Learn Git in a Month of Lunches",
      "isbn": "1617292419",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/umali.jpg",
      "status": "MEAP",
      "authors": [
        "Rick Umali"
      ],
      "categories": [],
      "price": 476.8598680454894
    },
    {
      "title": "Understanding SPAs",
      "isbn": "1617292435",
      "pageCount": 0,
      "thumbnailUrl": "https://s3.amazonaws.com/AKIAJC5RLADLUMVRPFDQ.book-thumb-images/scott2.jpg",
      "status": "MEAP",
      "authors": [
        "Emmit A. Scott",
        "Jr."
      ],
      "categories": [],
      "price": 458.73669180512456
    }
  ]
